[
  {
    "id": "INT-1-A1-1030-001",
    "code": "INT-1-A1-1030-001",
    "name": "アカデミックリテラシー",
    "description": "本科目の目的は、学生が大学で学ぶための方法を身につけ、自立した学修者になることにある。 具体的には、（１）ZEN大学の履修制度やツールの使い方、（２）大学で学ぶための基礎的な技法（情報収集、レポート作成、口頭発表の方法とツール）、（３）他者と協働して課題解決するための方法について学び、今後四年間の学びの方針を確立する。",
    "credits": 2.0
  },
  {
    "id": "INT-1-A1-1030-002",
    "code": "INT-1-A1-1030-002",
    "name": "現代社会と数学",
    "description": "本講義の目標は数学を様々な場面の問題解決や意思決定に活かすことである。しかしこれは容易ではない。１つには数学的スキルの欠如の問題がある。これに対応するのが第一部（ファイナンスとビジネス）、第二部（コンピュータ）の役割である。もう１つ難しいのは、ある問題場面に数学的な知識が使えると気がつけないことである。第三部（現代社会と数学）では数学が一般的なイメージより広い射程をもち、人文科学等の領域でも活躍することを紹介し、数理的な考え方を積極的に用いる態度の養成を狙っている。",
    "credits": 2.0
  },
  {
    "id": "INT-1-A1-1030-003",
    "code": "INT-1-A1-1030-003",
    "name": "ITリテラシー",
    "description": "ITの必要性を理解し、基本知識を身につけ、インターネットやAIの活用について学ぶ。メディアの知識やデジタル市民としての教育法も学び、コンピューターや通信の仕組みを知ることで、社会人としてシステムを適切に活用する力を身につける。さらにシステム開発や経営、関連法律にも触れ、ITに関する幅広い知識を得ることができる。",
    "credits": 2.0
  },
  {
    "id": "INT-1-A1-0204-004",
    "code": "INT-1-A1-0204-004",
    "name": "デジタルツールの使い方",
    "description": "高度に発達した昨今の情報社会では、どのような組織においてもデジタルツールが活用されており、デジタルツールを扱える人材の重要性が日に日に高まっている。デジタルツールの使い方では、様々なデジタルツールの基本的な使い方を実際に手を動かしながら学んでいく。また、情報モラル・情報セキュリティ・ネット犯罪等の対処法についても学んでいく。",
    "credits": 2.0
  },
  {
    "id": "INT-1-A2-1234-005",
    "code": "INT-1-A2-1234-005",
    "name": "人工知能活用実践",
    "description": "近年、人工知能ツールは目覚ましい発展を遂げており、日常生活や業務で人工知能ツールを活用することは、現代社会で活躍するためには必須である。本科目では、人工知能ツールを用いた演習、ツールの使い方に関する考察、アウトプットについての議論を行い、人工知能ツールを賢く使うための基本を身に付ける。思考の整理、データの収集および分析、マルチメディアの作成などに積極的に人工知能を活用する姿勢を身につける。",
    "credits": 2.0
  },
  {
    "id": "INT-1-A1-1030-006",
    "code": "INT-1-A1-1030-006",
    "name": "人文社会入門",
    "description": "ZEN大学で学べる「世界理解」科目群では、各学問分野の「ものの考え方」を深めることを意図している。具体的に、学問分野ごとの「ものの考え方」の多様性とはどのようなものか、各分野を学ぶことでどう世界の見方が拡がるか、それによって何がわかるようになるかを、分野ごとに各教員が説明する。",
    "credits": 2.0
  },
  {
    "id": "INT-1-A1-0204-007",
    "code": "INT-1-A1-0204-007",
    "name": "経済入門",
    "description": "経済学とは、さまざまな人や組織が市場でモノやお金を交換し合う行動を、前提や仮説をもとにモデル化し、シンプルかつ理論的に説明しようとする学問である。ミクロ経済学とマクロ経済学の基本的な概念を理解することにより、私たちの経済行動や意思決定の仕組みや本質的な目的について、論理的に考え理解する力を養う。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-1030-001",
    "code": "BSC-1-B1-1030-001",
    "name": "情報セキュリティ概論",
    "description": "情報化が高度に進み、一人で複数台インターネットデバイスを所持する現代社会において、情報セキュリティの重要性はますます高まっている。アカウントの乗っ取り被害やフィッシング詐欺など、情報セキュリティに関わる脅威は、身近な問題となりつつある。この授業では会社や普段の生活で必要な情報セキュリティの基礎知識と、その対応策を幅広く学ぶ。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-002",
    "code": "BSC-1-B1-0204-002",
    "name": "情報倫理と法",
    "description": "情報技術の発展とともに、それは、私たちに多くの恩恵をもたらしている一方で、トラブルや犯罪の発生など負の側面もある。この科目では、情報倫理の基礎から始め、情報通信社会の進化、メディアリテラシー、情報技術とセキュリティ、インターネットと犯罪、個人情報とプライバシー、企業と情報倫理等、様々な角度から情報倫理のあり方と関連する法について学修する。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-003",
    "code": "BSC-1-B1-0204-003",
    "name": "データサイエンス概論",
    "description": "データサイエンスの基礎知識を身につけることを目標にする。基礎的知識の中に個々の技術はもちろん含まれるが、それに加えて現代のデータサイエンスが成立した歴史的過程や統計学の考え方などのコンセプト理解も含めることにする。また、近年のホットトピックである、データ可視化の方法、統計学的因果推論的思考法についても取り扱うことで、データの表面的な理解でなく、構造を深く理解することができるよう講義を設計する。また講義の各所では適切にAIツールを用いる。AIツールは便利なものだが、その適切な使用には、統計学・機械学習の基礎知識が必要であることを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-004",
    "code": "BSC-1-B1-0204-004",
    "name": "数学的思考とは何か",
    "description": "古代から現代までを貫き、ますます多くの分野でその重要性が明らかになってきている数学的思考。「任意の」と「ある」という二語を切り口として数学の本質に迫った名著『数学入門』（著者は数学者であり後に偉大な哲学者として知られることとなったA. N.ホワイトヘッド）を手掛かりとしつつ、その後の数学の発展をも踏まえた現代的な立場から「数学的思考とは何か」を探求していく。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-1030-005",
    "code": "BSC-1-B1-1030-005",
    "name": "数学史",
    "description": "- 数学は第一級の歴史・考古学資料になり得る。\n- 数学史とは各々の文明圏から生じた数学の伝統が征服と同化を繰り返しながら一つの「世界の数学」に収斂していく文化的征服史である。\n● これらの基本理念に基づいて、各々の時代・地域の歴史を背景として浮き彫りになる数学の魅力を描き出すことを目的とする。数学を作ったのは誰か？各々の地域・時代で数学の担い手は誰だったのか？このように歴史の文脈の中で数学を見ることで、数学のイメージを刷新し、受講生各自の数学観を新たにしてもらうことを狙いとしている。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-006",
    "code": "BSC-1-B1-0204-006",
    "name": "現代社会とサイエンス",
    "description": "現代人にとって身近な技術や問題に関心を持ち、それらの背後に潜む科学技術について学ぶことは、私たちの生活をより理解しやすく、かつ豊かにするために欠かせない要素である。現代社会を支える技術は日進月歩で進化しており、これらの技術を理解し活用することで、より効率的で持続可能な生活が実現できる。また、地球温暖化などの環境問題も、私たちの生活に深く関わっている。これらの問題に対処するためには、その原因や影響を理解し、科学技術の力を活用して解決策を見つけ出すことが不可欠である。このように、身近な技術や問題について学ぶことで、私たちが直面する課題に対処し、より良い未来を築くための知識と力を身につけることができる。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-1030-007",
    "code": "BSC-1-B1-1030-007",
    "name": "日本文学Ⅰ",
    "description": "本授業では、日本文学から具体的な作品・作家を取り上げ、比較文学的に解読して日本を相対化し、グローバル化された世界で活躍できるための基礎となる概念と思考について考えたい。高等教育における人文系の必要性が問われる最中、文学はなぜ我々現代人にとって必要不可欠なのか、そしてより良い社会造りに文学はいかに役に立つのかについて学んでいく。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-1030-008",
    "code": "BSC-1-B1-1030-008",
    "name": "文化人類学Ⅰ",
    "description": "人類はどのように世界を見てきて、これからどのように見ていくのだろうか？インターネットや情報技術はどのような影響を人間に与え、変えていくのだろうか？そのヒントは文化の研究にある。本授業では、文化人類学の発展を確認しながら、文化の多様性を見るための方法と基礎的な論点を取り上げる。方法論に関しては、具体例からどのようにして世界観を観察、記録、分析できるのかを取り扱っていき、その解釈を試みることを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-009",
    "code": "BSC-1-B1-0204-009",
    "name": "心理学",
    "description": "人間の内面に光を当てて、心の働きについて理解したい。心理学は、そのような知的興味から誕生した。心理学では、個人（個体）の行動を観察することを重視しながら、なぜ人々はそのような行動をとるのか、なぜ人によって行動パターンが違うのか、人はどのように他者と関わっていくのか、といった問いに答えようとする。ここでは、遺伝的素地と環境との相互作用によって発達、変化していく心の側面を踏まえつつ、心の働きを解説する。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-1030-010",
    "code": "BSC-1-B1-1030-010",
    "name": "社会学Ⅰ",
    "description": "「社会」と聞いて、どのようなことを想像するだろうか？\n「社会に出る」「社会人」「社会問題」「社会のために」など、「社会」という言葉にはさまざまな用法がある。\nそうであるがゆえに、「社会」という存在は掴みづらい。しかし、わたしたちはそんな「社会」に生まれてから、死ぬまで関わり続けている。\nこの授業では、近くて遠い「社会」という存在について、人生においてどのように社会と関わるかという視点から考えていく。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-011",
    "code": "BSC-1-B1-0204-011",
    "name": "法学Ⅰ",
    "description": "この授業は日常生活で出会う問題を、法律の視点から分析して解決するための概念を説明する。具体的には、①法律と日常生活の関わりからはじまって、②日常生活に特に身近である民事法の他、刑事法や労働法、消費者法、会社法等について現在または将来役に立ちうる知識を修得し、③法律を学ぶためのスキルを伝達する。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-1030-012",
    "code": "BSC-1-B1-1030-012",
    "name": "伝わる論理とコミュニケーション",
    "description": "そもそも「考える」ということはどんな過程であるのか、細かく分解して捉えていくことで、”漏れなくダブりなく”のMECEや、軸や切り口、フレームワークで捉える認識の方法論等を教示する。具体的には、「論理」を構造主義的に認識し、ロジックツリー、ピラミッドストラクチャーなどのフレームワークを理解し、さらにそれらに基づく論理的思考、分かり易く論理的なコミュニケーションのストーリーライン構築について解説する。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-013",
    "code": "BSC-1-B1-0204-013",
    "name": "企業経営",
    "description": "本科目では企業が起業の後に他社との競争の中でいかに経営されていくかを、多数の企業の改革に参画してきた経営コンサルタントである講師の視点から教示する。具体的には小売り、遊園地、ホテル、機械メーカー、ネットビジネスなどの幅広い事例を通じ、マーケティングから戦略構築や組織運営、さらに経営再建などの経営手法を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-014",
    "code": "BSC-1-B1-0204-014",
    "name": "地域アントレプレナーシップ",
    "description": "地域は、農業や食、地場産業などの育成や事業承継、さらに少子化、高齢化、人手不足などさまざまな課題を抱えている。こうした課題解決の担い手は一義的には自治体や企業、農協などの組織だが、実際の成否を決するのは個人の活躍である。本授業では地域課題の解決の決め手となる個人の活躍に着目し、そこにおけるアントレプレナーシップの発揮とそれを支える環境やメカニズムをさぐる。すなわち、この授業では地域において組織の中、あるいは外にあって個人が自らの創意工夫を手掛かりに周りを巻き込みながら地域課題を解決していくダイナミズムを「地域アントレプレナーシップ」と定義し、その本質や成立条件を多面的に分析し再現可能性を探求する。なお各回の授業は地域アントレプレナーシップの事例に精通する専門家の協力を得ながら各地の具体例を掘り下げ、また必要に応じゲストとして各地で活躍するアントレプレナーを招き、対談、ヒアリングなどの多様な方法論でアントレプレナーシップの本質とその発揮の方法を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-B1-0204-015",
    "code": "BSC-1-B1-0204-015",
    "name": "地域課題の解決とイノベーション",
    "description": "地域には観光集客、農業振興、中心市街地の活性化、子育てなどさまざまな課題がある。この授業では、各地の事例を手掛かりに地域が抱える課題を理解し、またそれを解決する方法について学ぶ。\nなお、地域の再生の主役は人である。誰かが課題を直視し、仲間を募って解決に挑む。企業の協力を得たり、行政の補助金をもらったり規制の見直しを働きかける。この授業では課題の構造分析、利害調整、交渉、関係者（ステークホルダー）の共感取り付けと巻き込みなど、実際に課題の解決に挑む人の視点に立って地域を変えていく方法を考える。",
    "credits": 2.0
  },
  {
    "id": "BSC-1-A2-1234-016",
    "code": "BSC-1-A2-1234-016",
    "name": "多言語ITコミュニケーション",
    "description": "この授業では、最新のITツールを使った多言語コミュニケーションに重点を置いて学ぶ。第一にここでは異なる言語間での意思疎通の要点を学び、国際コミュニケーションの手法を探る。次に実際の海外のソフトウェアツールの利用や開発の現場で使われるコミュニケーション方法、ライセンスや利用規約の理解、海外の情報収集、海外の最新のサイエンス情報の取得方法など、多岐にわたる具体的なスキルや知識を習得する。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-1030-001",
    "code": "INF-1-C1-1030-001",
    "name": "ビジュアルプログラミング",
    "description": "目まぐるしく変化する情報化社会を生き抜いていくには、プログラミングの基礎を理解し、簡単なプログラムを実生活や職務に活かす能力が求められている。本科目では、ゲーム作りを通してプログラミングの基礎を身につけると同時に、ものづくりの楽しさを体験する。演習を通してプログラムの基本構造についての理解を深め、テキストプログラミングを学修していくうえでの素地を固める。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-1030-002",
    "code": "INF-1-C1-1030-002",
    "name": "Webアプリケーション開発1",
    "description": "完全な未経験者向けのプログラミング入門講座。HTML、CSS、JavaScript を身につけ、Webページ制作ができるようになる。JavaScriptというプログラミング言語を重点的に学修し、思い通りの動きをWebページにつけることができるようになり、CSS を使ってWebページのデザインを自由に変えられるようになる。ソーシャルコーディングサービスのアカウントを作成し、作成したWebページを公開する。\n学修にはPCが必要である。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-0204-003",
    "code": "INF-1-C1-0204-003",
    "name": "Webアプリケーション開発2",
    "description": "Webアプリケーション開発1の続編であるプログラミング入門講座である。\n発展的なプログラミング開発を行うために必要な事を身に付ける。\nLinux を使用しコマンドを実行したりシェルプログラミングを書くことで実践力を身に付ける。\nGitとGitHubを利用したバージョン管理ができるようになり、ソーシャルコーディングに参加できるようになる。\nNode.js を使い、ライブラリを使用した数値集計や、Slackで動作するボットアプリケーションの制作を行う。\n学修にはPCが必要である。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-0204-004",
    "code": "INF-1-C1-0204-004",
    "name": "Pythonプログラミング",
    "description": "人工知能や IoT など私たちの生活を豊かにする技術は、プログラミングによって支えられている。本科目では、日常生活におけるプログラミングの有用性を体験するために、Python を使って簡単なタスクを自動化するプログラムを作成する。また、コーディング演習を通してプログラミングの基礎を身に付け、個々の目的に合わせてより高度なプログラミングを学んでいくための素地を固める。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-0204-005",
    "code": "INF-1-C1-0204-005",
    "name": "Webユーザーエクスペリエンス",
    "description": "本科目では、Web上のユーザーエクスペリエンスに焦点を当て、UI(ユーザーインターフェイス)とUX(ユーザーエクスペリエンス)の設計に関する知識と技術を学ぶ。具体的なウェブサイト分析を通じてデザイン思想やユーザビリティの理解を深め、リサーチやデザイン、インプリメンテーションの方法を身につけることで、効果的なUI/UX設計ができるようになる。ニコニコ動画などの事例を取り上げながら、楽しく実践的な学びを展開する。また、授業の趣旨に即した実践者・実務者を招いての授業回がある。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-0204-006",
    "code": "INF-1-C1-0204-006",
    "name": "メディアアート史",
    "description": "メディアアートは、科学技術の発展と深く結びついている。コンピュータやインターネットなどの情報メディアの進化は、アーティストの創造の範囲を大幅に広げた。この講義では、メディアアートの領域全体を視野に入れ、起源、歴史、現状、および課題を学ぶ。アーティストや研究者などの実践者の視点からメディアアートを理解し、思考と哲学、基盤と組織、最先端の技術を活用した表現を理解することで、未来のビジョンを探求する。また、この科目にはゲストに話を聞く回が存在する。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-1030-007",
    "code": "INF-1-C1-1030-007",
    "name": "統計学入門",
    "description": "統計学は、実態の把握や世の中に起こる様々な現象の法則性を求めて発展し、今日の様々なデータ解析の礎となる学問である。本講義では、統計学の基礎として確率について触れて確率分布について学修し、さらに、本学「データサイエンス概論」講義で学んだ記述統計学の後に誕生した推測統計学などの重要な統計学について学修する。",
    "credits": 2.0
  },
  {
    "id": "INF-1-C1-1030-008",
    "code": "INF-1-C1-1030-008",
    "name": "ディープラーニング1",
    "description": "深層学習の基礎について扱う。\n• 深層学習を学ぶ事前知識として、機械学習の概要を把握する。\n• 多層パーセプトロン（MLP）の利点を理解し、その基本的な構成要素と基本的な学修方法を理解する。\n• ディープニューラルネットワークへ拡張するための要素技術や学習方法を理解する (活性化関数・確率的勾配降下法など)。\n• ニューラルネットワークの基礎を踏まえ、最適化・初期化・正則化などのより実践的な内容を理解する。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-001",
    "code": "INF-2-C1-1030-001",
    "name": "インターネット概論",
    "description": "インターネットがどのように形作られているのか、その背景や技術的な要素などについて解説する。ネットワーク同士の接続の仕組みであるASとBGP接続についてや、TCP/IPとDNSの仕組みなどインターネットを支えるそれぞれの技術の詳細についてや、物理障害による事例、国境問題や、大規模トラフィックに対する対応、DDoSなどのセキュリティ対策、最後にインターネットや電気通信を支える法律などの枠組みについても解説する。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-002",
    "code": "INF-2-C1-1030-002",
    "name": "プロジェクトマネジメント概論",
    "description": "プロジェクトマネジメントは、全ての人にとって役立つ知識体系である。本授業では、世界で標準的に教えられているプロジェクトマネジメントに準拠し、さらに、具体的な事例をもとに分かりやすく構成する。本授業では、プロジェクトマネジメントを行ううえで必須となる、次のような内容を扱う。WBS(Work Breakdown Structure)、スケジューリング、見積もり、品質マネジメント、リスクマネジメント、コミュニケーションと合意形成、調達など。なお、アジャイル開発の重要な概念である自律についても学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-003",
    "code": "INF-2-C1-1030-003",
    "name": "Webアプリケーション開発3",
    "description": "Webアプリケーション開発２の続編であるプログラミング入門講座。\nJavaScriptというプログラミング言語とNode.jsを使用してセキュリティ上の問題のないWebサービスが開発できるようになる。\n簡単なチャットサービスの開発を通じて、データベースを利用したデータの保存・更新・検索・削除を行う。\nまた、クラウドサービスを利用したWebアプリケーションの公開を行う。\n学修にはPCが必要である。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-004",
    "code": "INF-2-C1-1030-004",
    "name": "Linux概論",
    "description": "無償のOSであるLinuxを学修する。Linuxはサーバ構築や開発環境整備で幅広く活用されており、IT業界で活躍するにあたってはほぼ必須のスキルである。Linuxの概要から起動方法、コマンド操作、シェルプログラミング、セキュリティ対策、その他周辺知識まで、幅広い分野の内容を、実際に手を動かしながら学んでいく。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-005",
    "code": "INF-2-C1-1030-005",
    "name": "オブジェクト指向プログラミング",
    "description": "この科目では、Scalaというプログラミング言語を使い、オブジェクト指向プログラミングの基本的な概念と活用法を身につける。はじめてのScalaから始めて、基本的な文法や制御構文、デザインパターン、パターンマッチ等について理解を深め、簡単なアプリケーションを作成できるようになる。さらには、高度な開発環境の使い方も学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-006",
    "code": "INF-2-C1-1030-006",
    "name": "コンピューターサイエンス概論",
    "description": "コンピューターサイエンスにおいて重要な知識であるアルゴリズムとデータ構造の基礎を取り上げることで、基本的なアルゴリズムおよびアルゴリズムを考える際に重要なプログラムの効率や計算複雑性といった知識を理解する。プログラミング言語Pythonを活用して実際にプログラムを実行したり書き換えたりすることで、自らプログラムを書く能力を養う。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-0204-007",
    "code": "INF-2-C1-0204-007",
    "name": "JavaScriptによる自動化、効率化",
    "description": "プログラミングの基本的な考え方から導入し、Google Apps Scriptの駆使を目指す授業。\n具体的な課題を通して、アプリケーションの自動化と効率化の技術を学び、身につける。\nGoogle ドライブやGoogle スプレッドシート、Slackなど、日常生活でよく使うツールを自動操作する便利なスクリプトの作成を通じて、プログラミングの基礎知識と実践的なスキルを学んでいく。\n最終的には、WebスクレイピングやAPI、グラフ作成、外部サービスとの連携など、データ活用を中心とした実務で活用できるスキルについて学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-0204-008",
    "code": "INF-2-C1-0204-008",
    "name": "情報処理概論",
    "description": "IT業界での活躍を目指す学生にとって最適なカリキュラムがこの科目となる。\n基本情報処理技術者試験に必須な知識を修得し、コンピュータ理論、データベース、セキュリティ、ネットワーク、アルゴリズムを学ぶ。\n企業運営に必要な戦略やマネジメントもカバーする。\n詳細なセクションで構成された講義と問題演習で、しっかりと学び、IT社会を生き抜く知恵と教養を身につける。\nこの講座を通して、豊富な知識を獲得し、ITプロフェッショナルへの道を歩めるようになる。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-0204-009",
    "code": "INF-2-C1-0204-009",
    "name": "コンピュータ概論",
    "description": "計算の必要性から出発し、どのようにコンピュータが発展してきたかを概観することにより、現在のコンピュータの仕組みを理解する。そのことにより、将来、どのようにコンピュータが発展していくかを、検討できる力を身につける。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-0204-010",
    "code": "INF-2-C1-0204-010",
    "name": "Webアプリケーション開発4",
    "description": "Webアプリケーション開発３の続編であるプログラミング入門講座。\nJavaScriptというプログラミング言語とNode.jsを使用してセキュリティ上の問題のないWebサービスが開発できるようになる。\n本科目では、Webフレームワークを用いたWebアプリケーション開発を通じて、テストフレームワークを使えるようになり、データベースについてもしっかりと学修する。\n予定調整アプリを作りながらより実践的な開発手法を身につける。\n学修にはPCが必要。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-011",
    "code": "INF-2-C1-1030-011",
    "name": "機械学習概論",
    "description": "機械学習の基本から応用まで学ぶことができる科目。機械学習の3分類を理解し、pandasを活用したデータ前処理から、線形モデルやSVM、決定木とその発展形までを実践的に学ぶ。教師なし学習や次元圧縮、特徴量エンジニアリングも体得し、AI技術の幅広い知識を積み上げていく。さらに、例題を通じた技能向上のための試行錯誤も体験する。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-013",
    "code": "INF-2-C1-1030-013",
    "name": "ディープラーニング2",
    "description": "本講義では、深層学習研究における基礎となる２種類の構造について扱う。\n• 畳み込みネットワークの基本的な構成要素とその必要性について学び、畳み込みネットワークを利用した画像認識プログラムの演習を行う。\n• 代表的なRNN （Recurrent Neural Network; 回帰結合型ニューラルネットワーク）の諸手法の概要を学び、実装の演習を行う。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-014",
    "code": "INF-2-C1-1030-014",
    "name": "ビッグデータ分析概論",
    "description": "この授業では、ビッグデータ分析を行うために必要となる技術を広範囲に紹介する。\n特に、ビッグデータを扱うためのデータ基盤、データモデリング、SQLによるデータ分析、データガバナンスについて触れる。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-0204-015",
    "code": "INF-2-C1-0204-015",
    "name": "R言語プログラミング",
    "description": "Rは統計解析に特化して発展してきたプログラミング言語であり、データ解析やデータの視覚的表現が得意である。専門家はもちろん初学者にも適しており、R言語のプログラミングを学ぶことで、一般に用いられている表計算ソフトを用いるよりも自由にデータ解析を行ったり、情報を視覚的に表現することができる。\n本講義では、R言語の書き方を学び、実際にR言語でのプログラミングを用いたデータ解析の方法について学修する。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-001",
    "code": "INF-3-C1-1030-001",
    "name": "クラウドコンピューティング技術",
    "description": "この科目では、現代のWebアプリケーション運用に欠かせないクラウドコンピューティング技術について学ぶ。クラウド上でアプリケーションを展開する際のメリット・デメリットが理解できるだけでなく、様々なクラウドサービスを使い分け、実際に活用できる基礎知識が身につく。学修者は、その知識を活かして、クラウド技術を用いた効果的なWebアプリケーション開発・運用ができるようになる。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-002",
    "code": "INF-3-C1-1030-002",
    "name": "関数型プログラミング",
    "description": "Scalaというプログラミング言語を用いて、関数型プログラミングの思考と技法を身につける。具体的には、関数や多相関数の設計、エラー処理、リスト操作や遅延ストリームの実装について理解を深める。最終目標として、パーサーコンビネーターのライブラリを実装し、自分だけのプログラミング言語を作れるようになることを目指す。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-003",
    "code": "INF-3-C1-1030-003",
    "name": "オートマトンと形式言語理論",
    "description": "この科目では、オートマトンをはじめとする「計算機のモデル」のパラダイムと、「言語」という概念を数学的に定式化した「形式言語」という枠組みの 2 つをテーマとして取り上げ、一見距離のあるこれらの 2 つの間の密接な関係と、この 2 つが織りなす「計算」という現象に肉薄するとともに、具体的なプログラミング言語や計算機の実装方法や規格書などを垣間見ることで、普段はとりたてて詳しく追いかける機会の少ない「計算」「計算機」「プログラミング言語」といったものを掘り下げて「脱・神秘化」(demystify) していく。\nさらに、正則言語や文脈自由言語などの言語クラスが持つソフトウェアエンジニアリング領域へのきわめて重大な応用を学ぶことで、実践的技術と理論的直感の両方を培う。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-004",
    "code": "INF-3-C1-1030-004",
    "name": "暗号技術とその応用",
    "description": "本科目では、共通鍵暗号や公開鍵暗号、電子署名などの暗号技術を取り上げ、これらの技術がもたらす安全性とその限界、代表的な実現方法を理解する。歴史的な暗号技術も取り上げ、暗号技術が社会（政治、工業、技術）の発展とともに発展してきたことも理解する。さらに、我々の社会を支える通信技術が、暗号技術の組み合わせにより構成される仕組みを理解する。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-0204-005",
    "code": "INF-3-C1-0204-005",
    "name": "データベース運用実践",
    "description": "世の中には星の数ほどのデータがある。これらのデータを有効活用するためには、秩序を持ってデータを保存できる必要がある。\n秩序を持ったデータは、検索も早く、目的のデータを素早く発見でき、有益なデータを見つけるために必要不可欠である。\nこの授業では、データベースのインストールから運用方法まで学ぶ。\n特にPostgreSQLの構築・運用方法について学ぶことができる。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-0204-006",
    "code": "INF-3-C1-0204-006",
    "name": "並行処理プログラミング",
    "description": "この授業では、マルチスレッドによる並行処理の基本を学ぶ。最初に、スレッドやスレッドセーフという概念、そしてメモリの可視性と逸出という重要なテーマについて深める。その後は、Javaの並行処理の仕組みを学びつつ、他の言語（アセンブリ、C言語、Rust言語）における並行処理の取り組みも探求する。また、Akka Actorを利用したスケーラビリティと耐障害性を兼ね備えたプログラミングも理解し、一覧取得システムの開発に至るまでを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-0204-007",
    "code": "INF-3-C1-0204-007",
    "name": "画像処理論",
    "description": "コンピューターグラフィックスと画像処理を幅広く習得し、アルゴリズムや数学的知識の活用を理解できるようになる。講義では画像処理の概要から、モデリング、レンダリング、アニメーション、画像変換、パターン認識、復元、ビジュアル情報処理システムなど多岐にわたるトピックを網羅。知的財産権や情報セキュリティにも触れ、実用的なスキルを身につけることができる。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-0204-008",
    "code": "INF-3-C1-0204-008",
    "name": "論理回路概論",
    "description": "コンピューターがどうやって「計算」をしているのかという仕組みを、ビットのレベルまで掘り下げて把握していく。まずは、2 進演算の基礎となるブール代数と論理ゲートを知るところから始める。これらの原理を理解した上で、ハードウェア記述言語 (HDL) を用いて、自分自身で論理回路を作り出す。授業の前半を通じて組合せ回路に慣れ親しみ、その後でレジスタ・メモリ・カウンタといった時間の概念が絡む部品を構成し、コンピューターの中核となる部分を作り上げていく。最終的には、機械語を使ったプログラミングを実際に行い、「ひとつずつ命令を処理する CPU」という素朴なモデルを身につける。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-009",
    "code": "INF-3-C1-1030-009",
    "name": "データサイエンス実践Ⅰ（アンケート）",
    "description": "マーケティング分野では顧客の声を収集するためや市場調査のためにアンケート調査を行い、その分析結果をビジネスの意思決定に役立て、また心理学や社会学においてはさまざまな状況を把握するためにアンケート調査を行い、その結果を分析することが多い。適正な結果を導くためには、状況を正しく把握できるアンケート調査票を設計し、適正な方法で実施し、データを収集して分析をしなければならない。本授業では、有効なアンケートを実施するための手続について、アンケートの設計方法から分析の方法までを実習しながら学ぶ。分析には各種統計手法が必須であるため、第2～4回の授業では、統計的手法の復習をしながら分析手法を確認する。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-010",
    "code": "INF-3-C1-1030-010",
    "name": "データサイエンス実践Ⅱ（モデリング）",
    "description": "統計モデリングの授業では、正規分布を仮定した線形回帰を出発点として、一般化線形モデルや近年のニューラルネットベースの確率モデリング手法を含む、様々な発展的な確率モデルについても取り扱う。個々の手法を取り扱うにあたり、必要に応じて最急勾配法やサンプリング法など、パラメータ推定、ベイズ推論に必要なアルゴリズムや推定・推論結果の評価方法についても学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-0204-011",
    "code": "INF-3-C1-0204-011",
    "name": "データサイエンス実践Ⅲ（時系列）",
    "description": "時系列データの種類やその実世界における応用を踏まえ、時系列データ向けの様々な統計的手法を学ぶ。ARIMAやGARCHモデル等古くから広く使われるモデルだけでなく、近年注目されている因果推論に関連した手法やProphetやCausalImpact等、実用上重要な手法についても解説する。各手法の用途やツールの使い方だけでなく、その背後にある統計モデルの取り扱い、考え方や、パラメータの推定、推論のための手法についても触れていく。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-012",
    "code": "INF-3-C1-1030-012",
    "name": "ディープラーニング3",
    "description": "本講義では、深層学習研究における発展的な内容を扱う。\n• Chat-GPTやBingなどの大規模言語モデルを含めた自然言語処理について、概観とその技術について学ぶ。\n• グラフ構造を持つデータを柔軟に扱うグラフニューラルネットワークを取り上げ、データ構造に適したモデルについて学ぶ。\n• ニューラルネットワークがどう学習しているかを理解するための手法である説明可能性について取りあげ、社会における深層学習の重要性を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C1-1030-013",
    "code": "INF-3-C1-1030-013",
    "name": "ビッグデータ分析実践",
    "description": "企業におけるデータ分析は、研究で使用するデータセットよりも遥かに複雑であるとともに要点も異なる。\nこの授業では、実際のニコニコのデータで分析することを通して、実務的なデータ分析のノウハウを提供する。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-0204-001",
    "code": "MTH-1-C1-0204-001",
    "name": "数学の方法",
    "description": "大学での学問を学ぶために、最低限必要な数学の概念を講義する。主な内容は、関数/微積分/行列計算とその応用である。社会への応用事例を多く取り上げ、それらの数学がどのように我々の社会や生活に利用されているかについて講義する。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-0204-002",
    "code": "MTH-1-C1-0204-002",
    "name": "逆さ科学史",
    "description": "現代社会における科学の成果から出発し、その元となった科学的発見やエピソードへと遡ることで、科学技術の歴史の全体像を学ぶ（時系列ではなく、昔と今を比較し、現代科学から過去に飛ぶ「逆さ科学史」）。現代が「科学技術社会」であることを理解し、進化、RNA、量子といった科学のキーワードの起源を理解する。教養を高めるとともに、ビジネスなどへ応用できる基礎を築く。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-1030-003",
    "code": "MTH-1-C1-1030-003",
    "name": "初等代数概論",
    "description": "約数・倍数などの初等的な整数の性質から始めて、ユークリッドの互除法、素因数分解などの初等整数論の基本を履修する。その後、合同式やフェルマーの小定理など、整数のより進んだ性質に進み、最終的には、その応用としてRSA公開鍵暗号の仕組みをブラックボックスなしで完全に理解することを目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-1030-004",
    "code": "MTH-1-C1-1030-004",
    "name": "線形代数1",
    "description": "線形代数１では、線形代数の基本的なコンセプトとその理論的背景、そしてそれらがどのように幅広い分野に応用されるのかについて学んでいく。ベクトルの基本操作、行列の演算、連立方程式の解法、基底や次元などの概念を扱い、直交化法やQR分解なども学ぶ。また、線形計画法やゲーム理論についても触れることで、線形代数の幅広い応用力を身につけることを目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-0204-005",
    "code": "MTH-1-C1-0204-005",
    "name": "解析学1",
    "description": "微分積分の基本原理とそれらの応用について学修する。微分・積分の計算方法はもちろん、テイラー展開など近似の考え方や、ガンマ関数・ベータ関数など応用上重要な関数の扱いについても触れ、その上で微分方程式の解法やラプラス変換、微分方程式の数値解法を学ぶ。これら一連の学修を通じて、幅広い分野での微分積分の応用力を身につけることを目標とする。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-1030-006",
    "code": "MTH-1-C1-1030-006",
    "name": "線形代数2",
    "description": "線形代数１で学んだ基礎を活かし、線形代数の応用を深める。抽象的なベクトル空間や線型写像の概念を学び、線形空間の次元について理解する。さらに、固有値・固有ベクトルの理解から対角化といった線形代数の中心的な理論を学ぶ。さらに、確率行列や特異値分解、ベクトルの外積などといった高度な技術を扱い、より幅広い応用が可能な理解を目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-0204-007",
    "code": "MTH-1-C1-0204-007",
    "name": "解析学2",
    "description": "解析学２の授業では、多変数関数の微分積分を学び、微分積分の応用など高度なトピックに取り組む。特に、重積分や偏微分方程式の理解を深める。例題や演習を通じて理解を進展させ、物理学や工学、経済学などの分野でその応用可能性を探求する。新たな知識を積み重ねることで、微分積分の理論をより深く理解することを目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C1-0204-008",
    "code": "MTH-1-C1-0204-008",
    "name": "グラフ理論",
    "description": "グラフ理論は、ものとものの間のつながり方に着目した学問であり、離散数学分野における主要なトピックの一つである。今日では、ウェブシステムや交通網、電気工学、社会科学など、さまざまな分野に応用されている。本講義では、グラフという概念に親しんでもらい、グラフの持つ数理的な構造や諸定理を理解してもらうほか、工学・情報学的な応用例を多めに紹介する。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-0204-001",
    "code": "MTH-2-C1-0204-001",
    "name": "数理構造の発見と活用",
    "description": "数学の普遍性は、それが「構造についての学」であることによる。普遍性を可能にするのは「異なる現象について同じさを考えること」であるが、その「同じさ」とは結局「構造の同じさ」だからである。本講義では、数学において研究されている構造すなわち「数理構造」の様々な具体例を「圏論」と呼ばれる分野の基礎概念を導きの糸として学び、「数理構造とは何か」について各人がより明晰な理解を得ることを目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-1030-002",
    "code": "MTH-2-C1-1030-002",
    "name": "集合と論理",
    "description": "集合論と論理学の基本概念を中心に取り扱う。集合の構成や直積集合、写像、像と逆像、二項関係、商集合などの概念を学びつつ、数学的記法や集合演算、論理演算への理解を深めていく。また、述語論理や量化子を用いた証明と反例の扱いも鍛える。高校までの使用例を挙げながら、数の集合の構成や構造と準同型、普遍性、選択公理、濃度と順序数など、集合論と論理学の応用例や理論を学修する。この先の現代数学を学ぶための基盤を形成する。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-0204-003",
    "code": "MTH-2-C1-0204-003",
    "name": "記号論理",
    "description": "論理と証明は数学を記述するための最も基礎的な言葉であると同時に、正確な推論を行ったり他者を説得したりするのに便利なツールでもある。この授業では命題と述語を用いて文章を論理式を用いて正確に表現する方法を学び、論理式として表された主張を証明するための手法を身につける。形式化された証明を記述するにあたり、定理証明系と呼ばれるソフトウェアを利用する。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-1030-004",
    "code": "MTH-2-C1-1030-004",
    "name": "解析学3",
    "description": "解析学３では、ベクトル解析を中心に学び、ベクトル場の微分・積分、グリーンの定理、ストークスの定理、ガウスの定理などについて理解を深める。そして、微分形式、陰関数定理、接ベクトル、リーマン計量、接続と曲率、フロべニウスの定理といった幅広いテーマについても取り扱う。さらに、電磁気学、流体力学、弾性力学、トポロジー、幾何学などの具体的な応用例を通じ、理論を応用する力を養う。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-1030-005",
    "code": "MTH-2-C1-1030-005",
    "name": "距離空間",
    "description": "距離空間を中心に、その性質や特性を理解することを目指す。距離空間と連続性、実数の連続性、数列の収束、関数の連続性、中間値定理、最大値定理、積分、一様収束、極限の順序交換、開集合・閉集合、連結性、コンパクト性、関数空間のノルムなど、解析学の基本的な概念と定理に触れ、それらを自由に操れる能力を育てる。これらの理解を深めることで、数学の応用や理論の発展に対する理解も深まることを目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-1030-006",
    "code": "MTH-2-C1-1030-006",
    "name": "複素解析",
    "description": "複素解析について深く理解するための授業を行う。まず、基礎となる複素数や複素関数を学び、正則関数の定義から具体的な関数の計算までを学ぶ。次に、複素平面上での積分理論を整理し、特に線積分、コーシーの積分定理や公式について詳しい説明を行う。さらに、ベキ級数による関数の表現やローラン展開、留数定理などを学び、理論と具体的な計算の両面から理解する。最終的には、正則関数の諸性質について考え、複素解析の美しさと奥深さを感じてもらえるようにする。授業を通じ、複素解析の基本理論と計算技術を身につける。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-0204-007",
    "code": "MTH-2-C1-0204-007",
    "name": "日常に現れる物理学",
    "description": "日常生活に潜む物理的現象を、オンデマンド授業を通じて紐解く。本授業は、高校での物理の履修は前提とせず、物理学を初めて学ぶ人を対象に授業を行う。概算のテクニックから始まり、炭酸の泡、エアコン、ゴムの性質など幅広いテーマを学び、物理学の基礎と応用の幅広さを理解する。授業外では、教科書と映像を活用して自主学修を行い、それぞれの知識を深める。評価は確認テスト、レポート、及び単位認定試験による。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C1-1030-008",
    "code": "MTH-2-C1-1030-008",
    "name": "力学",
    "description": "古典物理学は、力学と電磁気学と熱力学の３つからなり、現代物理学の基礎となる学問である。古典物理学の学修は、現代の科学技術を基本原理から理解するために必要不可欠である。本講義では、高校での物理の履修は前提とせず、物理学を初めて学ぶ人を対象に、力学の講義を行う。力学は、物体に力が働いたときにどのような運動を行うか、その法則を明らかにする学問である。最初の11回で、質点系の力学を丁寧に学ぶ。続く4回で、剛体、流体、弾性体、粘弾性体などの身近な物体の力学を簡潔に学ぶ。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-1030-001",
    "code": "MTH-3-C1-1030-001",
    "name": "群論",
    "description": "現代数学は抽象的である。抽象的であるからこそ、文脈によらず幅広い応用が可能である。群論は「対称性」を抽象化した概念であり、数学はもちろん 自然科学・データ解析 など対称性があればどんなものにも適用が可能な理論である。\n本講義では、抽象的な数学の入り口として群論を学びつつ、群論がどのように数学や物理の中で現れるのかを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-0204-002",
    "code": "MTH-3-C1-0204-002",
    "name": "位相空間",
    "description": "位相空間論は現代の数学を記述するための基本的な言語であり、多様体やトポロジーを学ぶ上で基礎となるものである。位相空間と連続写像の定義から始めて、集合論的な操作により位相空間を構成する方法を学んだ後、分離公理・コンパクト性・連結性といった、位相空間の性質について学ぶ。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-0204-003",
    "code": "MTH-3-C1-0204-003",
    "name": "多様体",
    "description": "曲がった空間での微積分を行う枠組みである「多様体」について、その基本概念からより高度な幾何学を展開するための道具までを、一貫して学修することを目的とする。具体的には、多様体の定義や基本的な例の紹介から始め、その上での微分の枠組みを学ぶ。接空間やベクトル場、微分形式という基本的な道具の使い方を修得し、ベクトル束やリー群、リー代数を通じて幾何学を深く理解する。さらに、リーマン計量や測地線といった微分幾何学の概念を組み込むことで、数理科学の高度な理解が可能となる。この結果として、現代数学の中で重要な位置を占める多様体についての理解を深め、その応用力を身につける。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-1030-004",
    "code": "MTH-3-C1-1030-004",
    "name": "圏論",
    "description": "圏論の基本的な概念から現代数学への応用までを、数学的構造や構造と準同型の考え方についての具体的な例とともに学ぶ。まずは順序集合やモノイドを用いて圏と関手の理解を深め、自然変換、表現可能関手と米田の補題、普遍性、極限と余極限などを学んだ上で、関手と極限余極限の関係、随伴について学ぶ。最終的にはモナドと随伴、モナドの代数、カン拡張について理解を深め、圏論のさまざまな概念がカン拡張を通して理解できるという視点を提示する。さらに、モノイダル圏やモデル圏を通して、圏論的な概念が現代的な数学にどのように応用されるかを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-0204-005",
    "code": "MTH-3-C1-0204-005",
    "name": "数理統計",
    "description": "数理統計では統計学の知識を深め、より高度な理論を学ぶ。まずは初等統計学の復習から始め、確率変数と確率分布について理解を深める。その上で、多次元の確率分布や各種の確率分布を知り、それらの特性や関連性を把握する。極限定理、標本分布などの理論に触れ、十分統計量、尤度関数等を通じて最新の統計理論を学ぶ。また、統計的推測や仮説検定、区間推定等の枠組みを学び、それらの手法を使った具体的な統計解析も行う。最後には線形単回帰や重回帰、分散分析など実践的な話題も扱う。統計学の理論と応用を両方学び、データ分析の幅を広げることを目指す。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-1030-006",
    "code": "MTH-3-C1-1030-006",
    "name": "電磁気学",
    "description": "古典物理学は、力学と電磁気学と熱力学の３つからなり、現代物理学の基礎となる学問である。古典物理学の学修は、現代の科学技術を基本原理から理解するために必要不可欠である。本講義は、高校での電磁気学の履修は前提とせず、電磁気学を初めて学ぶ人を対象に、電磁気学の講義を行う。電磁気学は、電気、磁気、光などの物理法則を明らかにする学問分野であり、化学現象や電化製品を基礎づける。本講義では、最小限の労力で電磁気学の全体像を把握するために、電磁気学の基本原理を与えるマクスウェル方程式を学んだ後、マクスウェル方程式がどのように電気、磁気、光などの物理法則を説明するかを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-0204-007",
    "code": "MTH-3-C1-0204-007",
    "name": "量子力学",
    "description": "量子力学とは何か、その歴史と基本的な理論体系を学ぶ講義である。線形代数や微分積分の知識を前提に、量子性と呼ばれる４つの特性「物理量の離散化」「状態の重ね合わせ」「不確定性」「エンタングルメント」を学ぶ。できるだけ計算の煩雑性に惑わされずこれらの本質に迫るため、２準位量子系（量子ビット）やダイヤモンドのNV中心などの有限次元モデルを中心に講義する。オンデマンド授業という形式をとり、各回の講義内容は繰り返し見直し、必要に応じてWebでの調査も行いつつ、理解を深めることを目指す。評価は確認テストとレポート、及び単位認定試験による。本講義を通じて、量子力学の考え方を理解しそれを用いて物理現象を説明できる力を養う。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C1-0204-008",
    "code": "MTH-3-C1-0204-008",
    "name": "熱統計力学",
    "description": "本科目では、密接に関係する２つの物理学「熱力学」および「統計力学」を体系的に理解させる。これらはマクロとミクロの世界を繋ぐ普遍的な法則から成り、現代物理学に欠かせない理論体系である。前半の熱力学では、その基本法則の内容を具体例を通して順に解説する。後半の統計力学では、カノニカルアンサンブルを軸に様々な具体例を解析することを通じて、気体や固体のマクロな性質の理解を深めるとともに、統計力学の運用力を養う。",
    "credits": 2.0
  },
  {
    "id": "LAN-1-B1-1030-001",
    "code": "LAN-1-B1-1030-001",
    "name": "機械翻訳実践（英語読解・作文）",
    "description": "本科目では機械翻訳を英語学習のツールとして用いて、翻訳、逆翻訳などの方法を用いて英語そのものについての理解を深めさせ、今後ますます多様化していく英語世界の中で正しくかつ能動的に英語を運用する力を高める。また、その中で機械翻訳の現状、利点、限界を体験させ、機械翻訳を正しく用いる方法を実践的に修得させる。主にリーディングとライティングのスキルの向上を目指す。",
    "credits": 2.0
  },
  {
    "id": "LAN-2-B2-1200-001",
    "code": "LAN-2-B2-1200-001",
    "name": "機械翻訳実践（法学）",
    "description": "複数の地域に共有される法的トピックに関して英語などの外国語による論文、書籍、記事等を機械翻訳を読解ツールとして用いて読み込み、日本語の情報ソースに限らない幅広い情報源からの知識吸収の方法を提示する。また、その背後にある文化的・政治的差異や文脈を意識的に発見・解釈し、身近な環境がもたらすバイアスに気づく機会を与える。外国語文献の読解読解から得られた新たな知識、視点をさらに自らの興味・関心に結びつけて深化させる過程を指導する。",
    "credits": 2.0
  },
  {
    "id": "LAN-2-B2-1200-002",
    "code": "LAN-2-B2-1200-002",
    "name": "機械翻訳実践（情報）",
    "description": "情報技術やプログラミングに関する情報やチュートリアルは多数存在するが、その多くは英語で書かれており、これらのリソースを活用できていない日本語話者も多い。本科目では、機械翻訳を用いてこれらの英文資料を読解し、新しい知識を身につけるとともに、文化的差異について考察する。また、二次創作活動としての翻訳に挑戦し、日本語での表現力を養うとともに、日本の文化や言語に潜むバイアスに向き合う。",
    "credits": 2.0
  },
  {
    "id": "LAN-2-B2-0034-003",
    "code": "LAN-2-B2-0034-003",
    "name": "機械翻訳実践（異文化理解）",
    "description": "異文化理解に関する複数の外国語（英語、フランス語など）による論文、書籍、記事等を機械翻訳を読解ツールとして用いて読み込み、日本語の情報ソースに限らない幅広い情報源からの知識吸収の方法を提示する。また、その背後にある文化的差異や文脈を意識的に発見・解釈し、身近な環境がもたらすバイアスに気づく機会を与える。外国語文献の読解、読解から得られた新たな知識、視点をさらに自らの興味・関心に結びつけて深化させる過程を指導する。",
    "credits": 2.0
  },
  {
    "id": "LAN-2-B2-0034-004",
    "code": "LAN-2-B2-0034-004",
    "name": "機械翻訳実践（自然科学）",
    "description": "機械翻訳を外国語の読解ツールとして用いて読み込み、国内の情報源に限られない多角的な視点から問題状況を分析する方法を提示する。広範な科学分野の論文、書籍、記事等を読み込み知見を深めるとともに、どのように科学知識にアクセスするかの手段を教示する。また科学論文や雑誌記事の背後にある歴史や文化的差異を意識的に発見・解釈し、バイアスに気づく機会を与える。",
    "credits": 2.0
  },
  {
    "id": "LAN-2-B2-0034-005",
    "code": "LAN-2-B2-0034-005",
    "name": "機械翻訳実践（日本研究）",
    "description": "本授業では、海外の研究機関や研究者が運営する日本研究関連の英文資料データベース・ポータルサイトの学術的な文献を読解ツールとして用いて読み込み、日本の資料のみに限らない幅広い情報源からの知識吸収の方法を提示する。そうすることで、文化的差異や文脈を意識的に発見・解釈し、無意識的なバイアスに気づく機会を与える。また、外国語文献の読解から得られた知識、視点をさらに自らの興味・関心に結びつけて深化させる過程を指導する。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C1-1030-001",
    "code": "HUM-1-C1-1030-001",
    "name": "世界が変わる編集力",
    "description": "学びを自分の力にしていくためには、どの分野であれ「情報」を「編集」する基礎力が必要になる。学びにとどまらずあらゆる思考や活動の基盤となり、社会で活躍する人材にとっての必携技能である「編集力」を、演習を交えながら実践的に鍛えていく。編集工学の技法を習得し、世界知に分け入る方法とツールを手にすることで、ZEN大学での学びをより深める環境を、学生ひとりひとりの内面に整える。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C1-1030-002",
    "code": "HUM-1-C1-1030-002",
    "name": "リテラシーと応⽤のための物語理論",
    "description": "ロシア・フォルマリズム、民俗学、文化人類学、フロイド派、ユング派、ハリウッド映画の文法、歌舞伎理論、メディアミックス理論など多様な領域で発展してきた神話論や民話論を含む物語論を横断的に学び、物語が情報を構成し、同時に理解する「論理」であることを学び、報道や政治的言説に潜む「物語」を相対化できるリテラシーを身につけるとともに、創作に関心があるものはラノベ、ゲーム、アニメ、コミック、オンラインなどの物語表現を解析する物語創作の工学的基礎を養う。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C1-0204-003",
    "code": "HUM-1-C1-0204-003",
    "name": "哲学概論",
    "description": "西洋哲学は、神との本格的な決別を果たすことで「現代哲学」へと変貌を遂げました。本授業では、西洋近世哲学の一つの完成形態であるカントやヘーゲルの哲学から説き起こし、アジアの思想をも視野に入れつつ、19世紀から20世紀にかけての神なき時代の現代哲学の流れを追い、ますます多様化しつつある21世紀の状況にふさわしい哲学のありかたを考える。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C1-0204-004",
    "code": "HUM-1-C1-0204-004",
    "name": "公共哲学",
    "description": "本授業では、公共哲学の古典を身近な事例と、それを参照点としながら、目指すべき日本の将来像について考える。何が正しいのか、その基準が曖昧となった社会において、市民として善く生きるためにはどうしたら良いのだろうか。この授業では修羅場と想定外の事態に対して「最善」の選択をするために、「公共哲学」を学んでいく。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C1-0204-005",
    "code": "HUM-1-C1-0204-005",
    "name": "マンガ絵コンテから学ぶ視覚表現",
    "description": "紙のまんがにおける「コマの割り方」に特化した授業。一見、専門性が高く感じられるが全くまんがや絵が描けない初心者も聴講可能。日本の戦後まんがの手法は「映画的手法」と呼ばれる「映画」「アニメ」の演出と互換性が高い手法にあり、現在のweb、ショート動画も含め、視覚情報の「編集」の基礎理論でもある。近年「絵」は描けるが「コマが割れない」まんが家も多い、それは「映画的手法」の技術的継承がされていないためである。本授業はその復興を目論むと共に、縦スクロールやゲームの演出、生成AIの作画によるまんが創作など新領域に応用できる視覚情報の編集の最も基礎で汎用的な授業である。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C1-0204-006",
    "code": "HUM-1-C1-0204-006",
    "name": "近・現代アート概論",
    "description": "美術に関心がある、ないに関わらず、知っておくと視野が広がる20世紀に世界的に活躍したアーティストを紹介する。アートは知能情報社会において結びつきが見えづらくなっているノードの接点を直感的に可視化し、文脈を読み取る能力を獲得するのを助けてくれる。アーティストたちの作品の中からお気に入りのものを見つけ、彼らがどんな人生を送ったのかを想像し、その作風やテクニックを検証していく。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-1030-001",
    "code": "HUM-2-C1-1030-001",
    "name": "認知神経科学",
    "description": "私たちの知覚や記憶や感情が生み出されるのは、脳のどのような働きに基づいているのだろうか。認知神経科学（認知脳科学）は、このような知的興味から生まれた学問分野である。ここでは、知覚、認知、記憶、またそれらの発達的な変化などのいくつかの現象の背後にある脳の働き、具体的には脳のどのような部位が協力し合っているのかについて、研究現場の雰囲気を交えて解説する。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-1030-002",
    "code": "HUM-2-C1-1030-002",
    "name": "科学哲学",
    "description": "今日の我々の生活は、科学なしには考えられない。それとともに、「科学的である」ということは「正しさ」の基準のように捉えられている。しかし一体、「科学的である」とはどういうことだろうか？実のところ、科学という営みは実に多様であり、一言で定義できるものではない。本講義では、そうした多様な科学的営みを支える「科学的な考え方」や「推論の仕方」を、科学哲学の観点からあぶり出していくことで、過去、現在、そして未来の科学のあり方を考えていく。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-1030-003",
    "code": "HUM-2-C1-1030-003",
    "name": "人新世の人類学",
    "description": "「人間はどこから来て、どこへ行くのか？」――これが今ほど切実に問われる時代はない。いまや「大型動物の９割が人間とその家畜」と言われるほどに地球的な影響力を高めた反面、AIやロボットの進化により唯一の知的主体としての特権性が危ぶまれている。再生医療やゲノム編集により「寿命」や「生死」の概念も再定義され、宇宙時代には「地球的常識」もリセットされる。「人間の再発明」の時代の新たなコモンセンス（共通感覚）を探る。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-0204-004",
    "code": "HUM-2-C1-0204-004",
    "name": "日本文学Ⅱ",
    "description": "本授業では、主な文学的な批評理論・概念を紹介しながら、それを応用して具体的な文学作品を解読し、文学の視点から我々が現在直面している様々な社会問題について考えたい。国内外の文学作品から具体例を提示し、急速にグローバル化された社会において活躍するために基礎となる人文知識と概念について学んでいく。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-0204-005",
    "code": "HUM-2-C1-0204-005",
    "name": "文化人類学Ⅱ",
    "description": "「文化」は、物理と生物の自然界で説明できない人間の「世界」であり、この「文化」という言葉は時代や目的によって、様々な意味を持つようになった。本授業では、文化人類学の代表的な論点や文献を取り上げ、文化と世界観、自然界、と活動との関わりを検討し、「文化とは何か」を学ぶ。人間の基層的な問題がどのように議論されてきたのかを俯瞰することによって、これからの世界を想像する力を身につける。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-0204-006",
    "code": "HUM-2-C1-0204-006",
    "name": "民俗学",
    "description": "「方法なき方法論」とかつて吉本隆明に批判された柳田國男の民俗学が集合知としての「歴史」や「社会」を構築する「方法」それ自体にあったことを時間軸に沿って説明し、その問題系と方法、そしてアカデミズムによって知が分断される以前の総合性が現実及びオンラインの社会にどう「接続」するかを考える。また、柳田の学問が山人論に向かうロマン主義的側面と主権者教育運動の双極性を持つことの理解を通じ、その一方からしか語られなかった民俗学の全体像を講義する。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-0204-007",
    "code": "HUM-2-C1-0204-007",
    "name": "日本科学史",
    "description": "「人間にとって科学とは何か」——科学技術によって縁取られた現代社会に生きる私たちにとって、この問いは極めて切実なものである。本授業では、近代日本のあゆみのなかで科学を捉えることで、この問いに歴史からアプローチする。現代日本の科学を相対化したうえで、人間と科学の未来について、自分なりの考えを持てるようになることを目指す。なお、一部の回ではテーマに応じてゲスト講師をお招きする。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C1-0204-008",
    "code": "HUM-2-C1-0204-008",
    "name": "芸術と文化資本Ⅰ",
    "description": "いわゆる大富豪たちが蓄積した富によって美術館や図書館、オーケストラや大学が設立され、今も莫大な寄付金で非営利財団が運営されているアメリカ。「文化資本」とは何かを考えるため、莫大な利益を得た実業家たちを敵視するのではなく、利益を社会に還元することに意味を与えて讃えるアメリカ社会の価値観がどのように形成されたのかを分析して理解できるようにする。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C1-1030-001",
    "code": "HUM-3-C1-1030-001",
    "name": "統計学を哲学する",
    "description": "現代社会・科学において、統計学はデータから結論を導き出す装置として、特権的な役割を担っている。しかしなぜ統計学は、こうした役割を果たすことができるのだろうか？本講義では、統計という語で一般にイメージされるような数学的操作ではなく、むしろそうした数理の背景にある「考え方」を哲学的観点から捉えることで、その答えを探る。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C1-1030-002",
    "code": "HUM-3-C1-1030-002",
    "name": "日本大衆文化史",
    "description": "まんが、アニメなど現代日本の大衆文化の近代史を「西欧」のグローバル化に呼応するローカライズとして冷静に捉え、近代おたく文化の「方法」と「美学」を中心に1900-2000の「100年のおたく史」を概観する中で「日本ポップカルチャーの伝統起源論」や「作者」「オリジナル」をめぐる思い込みを解体し文化を見る目を再起動する「歴史の見方」を講義する。",
    "credits": 2.0
  },
  {
    "id": "SOC-1-C2-1200-001",
    "code": "SOC-1-C2-1200-001",
    "name": "AI社会の歩き方",
    "description": "現代社会は、情報技術の発展から大きく影響を受けており、情報技術がもたらすリスクとベネフィットに関して法・社会・倫理的観点を検討する必要がある。本授業は、各領域の実務家を中心としたゲストの講義を通じて、情報技術の中でも特に人工知能（AI)や分身ロボットを対象として、我々一人ひとりがAIとどのような関係にあり、AIのある未来をどのように描くかを考える力を身につける。具体的には（１）エンジニアとして、AI開発に際して検討する必要のある課題を知る、（２）利用者として、AIが生活、仕事や人生にどのような影響をもたらすかを考える、（３）AIが浸透する社会において、政治・経済・文化などにどのような変化や対策がもたらされるかを考える。",
    "credits": 2.0
  },
  {
    "id": "SOC-1-C1-0204-002",
    "code": "SOC-1-C1-0204-002",
    "name": "地域研究",
    "description": "本授業では、ある国や地域を理解するために、政治学・社会学・歴史学・文化人類学など、多様な領域の知識と考え方を用いる「地域研究」という領域について学ぶ。ある国や地域について理解する上で有用な観点は多様であり、様々な視点から世界の国・地域を理解する手法の理解を目的とする。具体的には、以下３つの能力の修得を目的とする。①国や地域を掘り下げて考え、時事問題や異文化をより解像度を上げて理解できるようにする。②そのための、歴史的・理論的・空間的・文化的な観点を身につける。③地域として、日本を相対化した視点で見れるようにする。",
    "credits": 2.0
  },
  {
    "id": "SOC-1-C1-0204-003",
    "code": "SOC-1-C1-0204-003",
    "name": "意思決定の能力開発",
    "description": "個人から社会に至るまで、我々の日常生活は意思決定にあふれている。意思決定は選択とそのための判断と定義される。意思決定の結果は、場合によっては自分の人生や社会に大きな影響を与える。本講義は、個人・小集団・組織の意思決定の順に、行動経済学、認知心理学、社会心理学等の知見を分野横断的に活用することによって、統合的な視座を与え、実際の能力の向上を図ることを目的にする。",
    "credits": 2.0
  },
  {
    "id": "SOC-1-C1-0204-004",
    "code": "SOC-1-C1-0204-004",
    "name": "共創地球論",
    "description": "最新科学の知見は、この地球が生命による惑星改造（テラフォーミング）の結果であると教える。だが酸素に満ちた大気を創った光合成生物も、大陸を「緑」の絨毯で覆った植物たちも、自分が地球を大改造しているという自覚はなかった。人類は地球史上初めて、自らの惑星改造のインパクトを現在進行形で認識し、未来を選択しうる種だ。「共創地球論」とは、そうした「共創する主体」として人間を位置づけ直した地球環境講義である。",
    "credits": 2.0
  },
  {
    "id": "SOC-1-C1-0204-005",
    "code": "SOC-1-C1-0204-005",
    "name": "情報社会の総合安全保障",
    "description": "われわれが生活をする社会の安全保障にとって、情報通信や産業インフラの確保とともに社会の基盤にある価値観や倫理を理解し思索する力が大切になっている。この講義では、日本の総合的な安全保障を（1）個別的および集団的な自衛、軍備管理・軍縮条約といった外交・国際政治、（2）資源の確保や半導体のグローバルなサプライチェーンといった経済安全保障、（3）ハイブリッド戦争やサイバーセキュリティのような先端的な情報通信技術、（4）政治経済体制とイデオロギーや社会哲学、という4点を含むものとして捉える。この講義は（ⅰ）髙見澤將林（元内閣官房副長官補／事態対処・危機管理担当、元ジュネーブ軍縮大使）、（ⅱ）山内康英（担当教員）の２名が担当する。政治と行政の実務経験者および研究者の視点を通して日本の安全保障の現状と課題を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C2-1200-001",
    "code": "SOC-2-C2-1200-001",
    "name": "ネット時代の著作権",
    "description": "著作権制度に関する基本的な説明を行い、その上でインターネット・デジタル環境下の著作権問題における最新の具体的なテーマについて解説を行うこととし、具体的な著作権問題について考えるための法的思考力を養う。本講座は授業の趣旨に即した実践者・実務者を招いての授業回がある。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-002",
    "code": "SOC-2-C1-1030-002",
    "name": "ジェンダー論",
    "description": "この授業では、「ジェンダー」や「LGBTQ＋」「インターセクショナリティ」「ポストフェミニズム」などのジェンダー論における基礎知識を学びつつ（第１～４回）、SNSやAIなどのデジタルテクノロジーとジェンダー（第５～７回）、音楽や映画、マンガなどのクリエイティブ労働とジェンダー（第８～１１回）、そして科学とジェンダー（第１２～１５回）をテーマに、現代社会におけるジェンダー問題を学んでいく。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-003",
    "code": "SOC-2-C1-1030-003",
    "name": "メディア論",
    "description": "「媒介」としての意味を持つメディアは、テレビ等のマスメディアだけを意味するもではなく、ネットやSNSだけを意味するものでもない。本講義は、漠然とイメージしがちなメディアについて、「つながり」という観点から考える。マスメディアだけでなく、様々な人の心理や、社会現象の背景を考えることで、多様なものの見方を養うことが可能となり、受講者自身が自ら考える力をつけることが可能となる。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-004",
    "code": "SOC-2-C1-1030-004",
    "name": "科学技術と社会",
    "description": "今日、科学技術と社会との関係はますます複雑化している。知識基盤社会が謳われながらも、高度に専門化された知識はしばしば私たちの理解を超え、一方でそうした専門知への不信も広がっている。こうした中で、私たちはどのようにして科学技術とよりよい関係を結ぶことができるのだろうか。本授業では、科学技術と社会の関係を考える科学技術社会論（STS）の知見を学ぶとともに、（専門家と市民双方の）責任、期待、無知、ジェンダーなどの多様な観点から、私たちと科学技術とのよりよい関係について考える。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-005",
    "code": "SOC-2-C1-1030-005",
    "name": "情報社会論",
    "description": "不確実で変化の激しい知能情報社会で価値の創造に踏み出すためには、まず情報社会の全体像を理解する必要がある。本授業では、このために（1）情報化を政治、経済、社会の視点から総合的に俯瞰する枠組みを示す。ここで情報化（informatization）とは、データや知識とICT（Information Communication Technology）つまり情報通信技術およびコンピュータのより高度な利用を促進するグローバルで自律・分散・協調的な活動のことである。つぎに（2）この総合的な枠組みとの関係で、情報社会の具体的な課題や争点を取りあげ、個別の課題や争点を考える際の前提となる社会科学の主要な研究を紹介する。こうした社会科学の研究は、個別の課題や争点を認識するパターン、研究の状況、解決の方策を提供するものである。この講義の全体は、つぎの4部構成になっている。①情報社会学の分析枠組みと情報通信の技術的背景、②情報社会の政策形成と政治過程、③情報社会の経済動向と政治経済思想、④情報社会の人文科学と基礎教養。この講義では知能・情報社会の観点から他の講義に繋がる導線を示す。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-006",
    "code": "SOC-2-C1-1030-006",
    "name": "戦後日本史1",
    "description": "本講義では、首相秘書官や関係者など政権中枢に近い人々をゲストに招き、「なま」の声をもとに戦後日本の「オーラル・ヒストリー」を描いていく。 敗戦後の民主化への努力、平和主義と日米同盟、高度経済成長とその歪み、バブルの崩壊と低成長といった、度重なる「板挟み」において、当時の日本のリーダーたちはどのような観点から、どのように「決断」をしたのだろうか。本科目では、終戦直後から、「戦後政治の総決算」を謳った中曽根康弘政権までを扱う。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-007",
    "code": "SOC-2-C1-1030-007",
    "name": "異文化理解",
    "description": "グローバルにつながった世界に生きる人間として、様々な文化の違いを理解することの重要性と楽しさを認識するきっかけを作る。異文化研究の代表的な概念やモデルの学修を通じて、国の文化の特徴を把握する力を身につけると共に、自分自身のアイデンティティや無意識の偏見を自覚し、他者と共に生き働く上での感度を鍛える。このような知識と意識の獲得を通じて、異文化間でのコミュニケーションや協業に積極的に取り組むマインドを養う。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-1030-008",
    "code": "SOC-2-C1-1030-008",
    "name": "大学とメディアの人類史",
    "description": "メディア革命とグローバル化の中での大学の苦境を人類史的な視野で捉え返す。第1部では、中世西欧の都市ネットワークを基盤とした大学の誕生を論じ、これと日本の「大学」概念の決定的な違いを示す。第2部では、近世以降、大学と出版がいかに絡まり合ってきたのかを、百科全書や図書館、博物館などと結びつけて論じる。第3部では、戦後の大学改革が大学紛争の中で挫折し、1990 年代以降の新自由主義の波を受けていく過程を論じる。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C1-0204-009",
    "code": "SOC-2-C1-0204-009",
    "name": "社会学Ⅱ",
    "description": "この授業では、社会学的思考法についての理解を深めていくことを目的とする。社会学は、その他の学問に比べると多様な対象を、多彩な方法で研究する学問であると言える。この講義では、「科学」「技術」「メディア」「都市」「経済」「政治」「環境」「グローバル化」「時間」「空間」など、さまざまな領域における社会学的思考を扱っていく。",
    "credits": 2.0
  },
  {
    "id": "SOC-3-C1-1030-001",
    "code": "SOC-3-C1-1030-001",
    "name": "法学Ⅱ",
    "description": "法律は私たちの日々の生活を規律している。日常で刑事法が問題となるのは例外的な場合であるが、民事法については気づかないまま触れているであろう。この授業では、人と人、人と物との関係を規律する民法の基本的な構造を描き出し、それによって、人との間で何らかの紛争が生じたときに、法的知識を駆使して相手と交渉し、説得するという武器としての法的思考を伝達する。",
    "credits": 2.0
  },
  {
    "id": "SOC-3-C1-0204-002",
    "code": "SOC-3-C1-0204-002",
    "name": "戦後日本史2",
    "description": "本講義では、首相秘書官や関係者など政権中枢に近い人々をゲストに招き、「なま」の声をもとに戦後日本の「オーラル・ヒストリー」を描いていく。 敗戦後の民主化への努力、平和主義と日米同盟、高度経済成長とその歪み、バブルの崩壊と低成長といった、度重なる「板挟み」において、当時の日本のリーダーたちはどのような観点から、どのように「決断」をしたのだろうか。本講義では、消費税を導入したことで知られる竹下登政権から、戦後最長期政権となった安倍晋三政権までを扱う。",
    "credits": 2.0
  },
  {
    "id": "ECON-1-C1-1030-001",
    "code": "ECON-1-C1-1030-001",
    "name": "経済言説史",
    "description": "経済学は既に200年以上の歴史を持った学問である。現在世界中で教えられている経済学はどのようにして発展し、一体何を問題とし、どのように解決してきたのか。また、現在どのような問題が残されているのか。経済学を巡る言説・言論の歴史を振り返ることで、経済学が問題にしてきた本質的な点を考察していく。その視点を通すことで、現代社会の多くの問題を経済学的に批判的に捉えなおす能力を身につけることができる。",
    "credits": 2.0
  },
  {
    "id": "ECON-1-C1-0204-002",
    "code": "ECON-1-C1-0204-002",
    "name": "マルクス経済学",
    "description": "この授業では、「資本主義」とはどのような社会なのかを考えていく。本来、経済活動とは、人々がこの地球上で他者や自然とともに生きていくための行為である。ところが、なぜ人は過労死をするまで働いてしまうのか。なぜ生きるための生産・消費活動が深刻な環境破壊を引き起こしてしまうのか。本講義では、マルクスの『資本論』を手がかりとして、「商品」「貨幣」「資本」といった概念を学びながら、資本主義社会の全体像を再構築していく。",
    "credits": 2.0
  },
  {
    "id": "ECON-1-C1-1030-003",
    "code": "ECON-1-C1-1030-003",
    "name": "企業経営と会計",
    "description": "本科目では、会計の歴史や簿記のしくみの説明から始まり、財務諸表の基礎的な読み方及び実践的な分析方法を修得させる。身近な企業の実例の分析を通じて、財務諸表にあらわれる業種の特徴やビジネスモデルへの関心や理解を高め、学生が将来のいかなるキャリアにおいても会計の知識と理解を積極的に活用するスキルとマインドを養う。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-1030-001",
    "code": "ECON-2-C1-1030-001",
    "name": "マクロ経済学",
    "description": "国の景気を測るには、GDPや失業率、消費者物価指数、貿易収支などが利用される。経済発展は、GDPの成長率や一人当たりのGDPを通じて測定される。マクロ経済学の基本概念を理解し、政府機関や国際機関、経済研究機関などが提供するデータを利用することで、経済の現状を把握し、課題を分析する視点を身につけられる。これにより、経済全体の動きを把握し、持続可能な発展に寄与することができる。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-0204-002",
    "code": "ECON-2-C1-0204-002",
    "name": "ミクロ経済学",
    "description": "私たちを取り巻く複雑な経済環境における、個々の消費者や企業が巻き起こすさまざまな事象を、ミクロ経済学の考えを用いて解釈する方法を紹介する。具体的な事例の考察をもとに、個々の消費者がどのような行動を通じて合理的な選択を試みているのか、また企業はどのように利潤の最大化を目指すのか、それぞれの意思決定プロセスの仕組みを理解し、社会やビジネスの事象に対する、より複合的かつ客観的な視点を養う。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-0204-003",
    "code": "ECON-2-C1-0204-003",
    "name": "企業経営とファイナンス",
    "description": "本科目では、キャッシュの観点から見たリスクやリターンに加えて事業の資金調達について取り上げる。企業価値の時価をどうやって計算するか、有利子負債と自己資本からなる資本構成をどうやって最適化するかの基礎的な考え方を解説し、理解してもらう。さらに将来のプロジェクトを評価する方法、スタートアップの資金調達、Ｍ＆Ａやグループ企業の財務最適化についての基礎を考える能力を養う。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-0204-004",
    "code": "ECON-2-C1-0204-004",
    "name": "デジタル・マーケティング",
    "description": "企業マーケティングは、今や日々発生する膨大な量のデジタルデータの処理・分析を前提に進化している。本科目では、企業が利益を上げて設定した成長目標を達成できるための礎となるマーケティング全般の基礎を教示する。具体的には、デジタルツールを用いたデータの収集・集計・分析の基礎を伝え、それら解析結果を活用して、当該企業が顧客に提供する価値がその商品・サービスの購入・消費において的確に伝えられる方策を提示する。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-0204-005",
    "code": "ECON-2-C1-0204-005",
    "name": "スタートアップ",
    "description": "本科目では、多くの学生が起業を身近な活動として捉え、学生起業や将来のキャリアの選択肢として検討できるようになることを目指す。具体的には、リーンスタートアップ、デザイン思考、プロトタイピング、AI、アジャイル開発、仮説検証、資金調達、ベンチャーキャピタルといった、スタートアップの事業開発に関わるプロセスや重要な概念を事例を通じて伝える。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-0204-006",
    "code": "ECON-2-C1-0204-006",
    "name": "農業とデジタルテクノロジー",
    "description": "都会と繋がりながら地方で暮らすライフスタイルに関心を持つ人々が増えてきています。デジタルテクノロジーと情報通信網の進化により農村で起きつつある社会変化のひとつである「半農半X」をめぐる動きを理解することにより、自らがプレイヤーとなって農村で小さなスタートアップに取り組み、地域社会の活性化にも貢献するための基礎を学びます。",
    "credits": 2.0
  },
  {
    "id": "ECON-2-C1-0204-007",
    "code": "ECON-2-C1-0204-007",
    "name": "交渉・合意形成概論",
    "description": "２人以上の人間や集団の間では、利害が完全に一致することはない。デートの場所の決定から国際紛争の解決に至るまで、合意を達成するには、何らかの交渉が必要となる。ビジネスの大部分は組織内外の利害関係者との交渉に絡んでおり、またほとんどの政策は利害団体の間の連続的交渉によって決定される。本科目は、交渉に関する科学的知見を分野横断的に提供するとともに、交渉力をつけるための実践的方策を提供する。",
    "credits": 2.0
  },
  {
    "id": "DIGI-1-B1-1030-001",
    "code": "DIGI-1-B1-1030-001",
    "name": "IT産業史",
    "description": "本科目では、今日の視点に立った「IT産業史」を取り上げ、ネット、モバイル、IoT、AIへと連なる21世紀の我々の生活や社会に合致した歴史観を理解させる。日本がITの世界で何をなしえたかを検証することで、我々が、今後も応用可能となる製品戦略やビジネスモデルへの理解を促し、これからの時代を生き抜くすべての人が当たり前に知っているべき教養としてのITの歴史を教える。また、ゲストと教員がディスカッションをすることで知識を高めていく。",
    "credits": 2.0
  },
  {
    "id": "DIGI-1-B1-1030-002",
    "code": "DIGI-1-B1-1030-002",
    "name": "マンガ産業史",
    "description": "本科目では「マンガ産業」の歴史を戦前から現在に至るまで、出版社・編集者・マンガ家など、様々な立場からの視点を通じて俯瞰的に学ぶ。子ども向けの娯楽として立ち上がった「マンガ産業」がいかにして、現在のような巨大産業へと発展していったのかを深く理解することで、エンタメ産業の推進に必要とされるマインドセットを学ぶ。また、ゲストと教員がディスカッションをすることで知識を高めていく。",
    "credits": 2.0
  },
  {
    "id": "DIGI-1-B1-0204-003",
    "code": "DIGI-1-B1-0204-003",
    "name": "アニメ産業史",
    "description": "本科目では、アニメを「日本の誇るべきメディア芸術」として取りあげ、授業を通して「アニメの成り立ち」を歴史、芸術、ビジネスなど、さまざまな観点から解説する。「見ればわかる」と思われがちなアニメを「ものづくりの事例」として理解することを目標とする。「世の中で流通する商品には何が必要か」を思考するための基礎能力を高めることで、将来自分が携わる仕事に何が必要とされるかを想像できる能力を養う。",
    "credits": 2.0
  },
  {
    "id": "DIGI-1-B1-0204-004",
    "code": "DIGI-1-B1-0204-004",
    "name": "日本のゲーム産業史",
    "description": "本科目では、日本におけるゲーム産業の歴史を概観しつつ、家庭用ゲームやスマホゲームなど、ジャンルごとの個別の歴史を詳細に取り上げる。日本ゲーム産業を築きあげたビジネスモデルや、ヒットの裏側にあった社会環境、文化的背景などを理解することで、多角的な視点から日本のゲームの歴史の大きな流れを学び、時代の変化に対応する思考力や対応力を養う。なお、いくつかの授業ではゲストスピーカーをお呼びし、ゲームジャンルとは異なる切り口からディスカッションを行う。",
    "credits": 2.0
  },
  {
    "id": "DIGI-1-C2-0034-005",
    "code": "DIGI-1-C2-0034-005",
    "name": "二次創作の歴史から見るネット文化",
    "description": "ネットは複製可能なデジタル世界。そこで生まれた文化に於いて複製からの派生とも言える二次創作は非常に重要な位置を占める。本科目では、。当事者であるゲストからの解説をきくことで、各出来事における深い知識が養える。",
    "credits": 2.0
  },
  {
    "id": "DIGI-2-C1-1030-001",
    "code": "DIGI-2-C1-1030-001",
    "name": "コンテンツ産業論",
    "description": "知的創造産業、情報文化産業としてのコンテンツ産業とそのマネジメントを探求する。現代のコンテンツを代表するMANGA（マンガ、アニメ、ゲーム）から、SNS、メタバース、ユーザー制作コンテンツといった新しい動向についても総合的に理解を深める。講義の進行とともに、映画、音楽、ゲームのような伝統的な制作物から、クロスメディアと呼ばれる新しい複合創作へと転換しつつある現代のコンテンツ産業の全体像について理解を深める。",
    "credits": 2.0
  },
  {
    "id": "DIGI-2-C1-1030-002",
    "code": "DIGI-2-C1-1030-002",
    "name": "ゲーム制作論基礎",
    "description": "この授業では、ゲーム会社におけるゲーム制作から販売までの一般的なモデルケースを取り上げる。商業ゲームにおける企画立案に至るまでの経緯やプレゼンテーションやシステム設計・ビジュアルサウンドのデザイン、UI/UXデザイン、シナリオライティングなどゲームに必要なプロセスを種目ごとに取り上げる。いくつかの授業ではゲストスピーカーをお呼びし、実際の仕事についてディスカッションを行う。",
    "credits": 2.0
  },
  {
    "id": "DIGI-3-C1-1030-001",
    "code": "DIGI-3-C1-1030-001",
    "name": "ゲーム制作論応用",
    "description": "この授業では、シューティングゲームからRPG、音楽ゲーム、オンラインゲームまで、一流のゲームクリエイターの実際の仕事を、各ジャンルごとのゲームデザインのケーススタディとして取り上げる。本授業を通して、一流の作品がなぜ一流であるかを理解する観察眼や、ものの見方の解像度を高める。いくつかの授業ではゲストスピーカーをお呼びし、実際の仕事についてディスカッションを行う。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C1-0204-001",
    "code": "CAR-1-C1-0204-001",
    "name": "キャリアデザインⅠ（自己理解）",
    "description": "本科目では、学生が自分のキャリアを形成していくために必要なキャリアデザインについて知り、その一要素として自己を知ることを中心に取り組む。また、不確実で変化の激しい知能情報社会において長期的な人生を主体的に歩むうえで必要となる考え方、社会や働くことについての基本的な知識を提供する。これらの学びを通じて、大学生活を有意義に過ごすための具体的な目標と計画を立て、実行することを支援する。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C1-1030-002",
    "code": "CAR-1-C1-1030-002",
    "name": "英語コミュニケーションⅠ（発音）",
    "description": "世界の多様な人々とコミュニケーションを行う際に欠かせない、滑らかで途切れない英語を話すために必要な発音の理論と具体的なトレーニング方法を提示する。英語の流暢さを構成する日本語から英語への変換力・反射力・発音など、これらのすべての要素を一挙に磨くことの重要性を伝え、英語で自分の考えや感情を伝えるための自信、楽しさを養う。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C1-0204-003",
    "code": "CAR-1-C1-0204-003",
    "name": "英語コミュニケーションⅡ（日常会話）",
    "description": "この授業では、英語という言語の国際的な位置づけについて言語学、英語教育学、社会学などの学問分野と関連を包括的に提示する。そして、英語の４技能を活用しながら、日常のコミュニケ ションにおいてよく使う表現を理解し、場面や目的に応じた適切なコミュニケーションの取り方について、様々な具体例を通して実践的な理解を深める手助けをする。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C1-0204-004",
    "code": "CAR-1-C1-0204-004",
    "name": "対人コミュニケーション論",
    "description": "初対面の人とのコミュニケーションは、社会での活動に不可欠である。それが苦手という人は多いが、ほとんどの場合、適切な方法を学んできていないからである。だが、コミュニケーションは技術として後天的に誰でも習得可能なものだ。本授業では、かつていわゆる「コミュ障」だった講師が、20年以上にわたるラジオパーソナリティ経験を通して得た、特に会話における実戦的かつ受講直後から使えるコミュニケーション術を伝授する。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C2-1200-005",
    "code": "CAR-1-C2-1200-005",
    "name": "クリエイティブ現場論",
    "description": "本授業では、脚本家、放送作家、マンガ家、小説家、アニメ監督、タレント等、クリエイティブな現場で日々活動している実践家たちをゲストとして招き、講師との対話を通じてそれぞれの現場における業務内容や仕事術を理解する。さらには、全15回の授業を経て業界に通底する仕事のエッセンスを学ぶことで、クリエイティブな現場で求められる姿勢や、社会の中で自身の価値を発揮する術を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C2-1200-006",
    "code": "CAR-1-C2-1200-006",
    "name": "ソーシャルイノベーション概論",
    "description": "近年、ますます複雑化する社会問題は、行政はもとより市民にかける負荷が増大している。相互扶助の社会を実現するために、ソーシャルイノベーション（社会変革）を進めるNPO、企業、行政、研究者、アスリート等のリーダーをゲストスピーカーとして招き、事例を交えながら社会課題の解決に向けた術を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C2-0034-007",
    "code": "CAR-1-C2-0034-007",
    "name": "ネット情報発信概論",
    "description": "Webクリエーションの現場からインフルエンサー、政治家、経済人といった多様な視点からWeb表現の可能性および実人生に活かすことのできる知見について考察する。オリエンテーションで全体像を抑えた上で、ゲストたちの具体的な事例や視点を通じてクリエイティブな表現を学んでいく。コンテクストに応じた適切な表現方法を理解し、具体的な事例を通して「伝える技術、理解する技術、知見を広める技術」を学ぶ。本科目は授業の趣旨に即した実践者・実務者を招いての授業回がある。",
    "credits": 2.0
  },
  {
    "id": "CAR-1-C1-1030-008",
    "code": "CAR-1-C1-1030-008",
    "name": "デジタル画像技法論Ⅰ",
    "description": "この授業ではデジタルイラストツールの基礎知識を学びその役割について考察する。併せて表現上のレクチャーを行う。デジタル化した現代社会で、コミュニケーション及び課題解決の手段として画像による可視化は重要な位置を占める。共有スピードが速く、表現の多様性とクオリティの進化が著しい画像メディアの現状を学ぶ。本学では知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "CAR-1-C1-1030-009",
    "code": "CAR-1-C1-1030-009",
    "name": "デジタル画像技法論Ⅱ",
    "description": "この授業ではクロッキーにより重心、バランス感覚を習得、画像を構成する物理法則を知る。併せて表現上のレクチャーを行う。デジタル化した現代社会で、コミュニケーション及び課題解決の手段として画像による可視化は重要な位置を占める。共有スピードが速く、表現の多様性とクオリティの進化が著しい画像メディアの現状を学ぶ。本学では知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "CAR-1-C1-0204-010",
    "code": "CAR-1-C1-0204-010",
    "name": "デジタル画像技法論Ⅲ",
    "description": "この授業ではコミックを題材に演出、カメラワークなどを学びその役割について考察する。併せて表現上のレクチャーを行う。デジタル化した現代社会で、コミュニケーション及び課題解決の手段として画像による可視化は重要な位置を占める。共有スピードが速く、表現の多様性とクオリティの進化が著しい画像メディアの現状を学ぶ。知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "CAR-2-C1-1030-001",
    "code": "CAR-2-C1-1030-001",
    "name": "キャリアデザインⅡ（仕事理解）",
    "description": "本科目では、自分のキャリアを主体的に展望し、デザインできるようになるために、働くことや働く環境などの仕事面に焦点を当てて講義を行う。産業や企業活動に関する基礎知識、企業が求める人材、業種・職種の特徴、働く意味や意義、多様なワークスタイルなど、働くことの現実について取り上げる。社会人から実際の話を聴く機会も設定し、学生が自分の興味、特性、希望などとつなげて納得のいく進路選択ができるようになることを目指す。",
    "credits": 2.0
  },
  {
    "id": "CAR-2-C1-0204-002",
    "code": "CAR-2-C1-0204-002",
    "name": "キャリアデザインⅢ（就活実践）",
    "description": "本科目では、就職活動に主体的に取り組むために必要な知識、スキル、態度について取り上げる。近年の就職活動の状況、必要な準備や心構えについて説明した後、自己理解、業界・職種および企業理解、応募書類や面接における自己表現の方法などについて講義をする。課題への取り組みを通して体験的に理解が深まるように働きかけ、学生が卒業後に納得のいくキャリアを歩み始められることを目指す。",
    "credits": 2.0
  },
  {
    "id": "CAR-2-C1-0204-003",
    "code": "CAR-2-C1-0204-003",
    "name": "人生設計とお金の管理",
    "description": "人生100年時代を迎え金融リテラシーの重要性は近年ますます高まっており、将来を見据えたライフプランニングや資産形成、若者を狙った詐欺に代表される金融トラブルを自ら回避するための判断力といった、私たちの生活に密接に関係する知識をＳＭＢＣグループ各社の現役社員がそれぞれの本業で培った経験を活かし講義で伝える。",
    "credits": 2.0
  },
  {
    "id": "CAR-2-C2-1200-004",
    "code": "CAR-2-C2-1200-004",
    "name": "ネットワーク産業論",
    "description": "AIやIoTを含むIT技術やネットワークの特性がもたらす政治経済への影響、産業構造の変化、企業戦略に強いる改革などを分析し、その社会的インパクトを正しく理解する。そのために、ネットワークに直接かかわりのある通信産業やIT産業に留めず、あらゆる産業、市場、社会体制、経済システムを対象に、どのような構造変化がもたらされているかを概説する。授業は講義だけでなく、ネットビジネスの最前線にいるゲストスピーカーの講演を織り交ぜ、実践的な知識を身につけた上でのその応用を目指す。",
    "credits": 2.0
  },
  {
    "id": "CAR-2-C1-1030-005",
    "code": "CAR-2-C1-1030-005",
    "name": "デジタル画像創作論Ⅰ",
    "description": "デジタル社会において画像表現は進化し続け、エンタテインメントを始めビジネスの現場でも中心的役割を担っている。デジタル画像創作論の授業ではレクチャーを通して画像の各種技法と可視化による課題解決を学び、併せて商業的な役割を考察する。この授業では画像のビジネス的展開の代表であるデザインについて学修する。イラストとデザインの違い、イラストをはじめとしたコンテンツを活かすデザインの手法、伝わるデザインについて学ぶ。",
    "credits": 1.0
  },
  {
    "id": "CAR-2-C1-0204-006",
    "code": "CAR-2-C1-0204-006",
    "name": "デジタル画像創作論Ⅱ",
    "description": "デジタル社会において画像表現は進化し続け、エンタテインメントを始めビジネスの現場でも中心的役割を担っている。デジタル画像創作論の授業では具体的に手を動かして画像の各種技法と可視化による課題解決を身につけ、併せて商業的な役割を考察する。この授業ではキャラクター画像について、デフォルメからリアル頭身までデザインのバリエーションを知り、自分の技術や嗜好に合ったスタイルを模索することで、基本から学修する。",
    "credits": 1.0
  },
  {
    "id": "CAR-2-C1-0204-007",
    "code": "CAR-2-C1-0204-007",
    "name": "デジタル画像創作論Ⅲ",
    "description": "デジタル社会において画像表現は進化し続け、エンタテインメントを始めとしたビジネスの現場でも中心的役割を担っている。デジタル画像創作論の授業では学生自身が具体的に手を動かして身体感覚と思考を融合させる学修を行って画像の各種技法と可視化による課題解決を身につけ、併せて商業的な役割を考察する。この授業では人物画の基本的な制作を学び、コミックにおける人物画について考察する。併せて表現上のレクチャーを行う。",
    "credits": 1.0
  },
  {
    "id": "CAR-3-C1-1030-001",
    "code": "CAR-3-C1-1030-001",
    "name": "デジタル画像活用Ⅰ",
    "description": "デジタル画像活用の授業では、ビジネスシーンにおける画像の役割を広く学んでゆく。共有スピードが速く、表現の多様性とクオリティの進化が著しい画像メディアの現状と可視化による課題解決を学ぶ。知識を本質的なものとするため、制作をすることで、身体感覚と思考を融合させる学修を行う。この授業では視覚のみに頼らず、感じたものを表現することを命題に模写を実践し、観察力を養う。併せて表現上のレクチャーを行う。",
    "credits": 1.0
  },
  {
    "id": "CAR-3-C1-0204-002",
    "code": "CAR-3-C1-0204-002",
    "name": "デジタル画像活用Ⅱ",
    "description": "デジタル画像活用の授業では、ビジネスシーンにおける画像の役割を広く学んでゆく。この授業ではプロデュース・ディレクションの視点に立ち、エンタテインメントや広告・宣伝の現場における画像を使ったビジネスのあり方と可視化による課題解決を学ぶ。発注のしかたやスケジュール管理など制作管理のフロー、トラブルシュートの事例などを学修し、イラストレーターを始めとしたクリエイトサイドとのコミュニケーションを身につける。",
    "credits": 1.0
  },
  {
    "id": "INF-1-C3-0034-009",
    "code": "INF-1-C3-0034-009",
    "name": "情報収集と伝達技術",
    "description": "AIや検索技術、動画サービスの浸透に伴い、私たちの学び方も変わりつつある。本科目では、その変化を先取りし、AI等の最新ツールを使った最先端の学習方法を探求する。事前に与えられた課題を基に情報収集やコンテンツ制作を行い、授業内でその成果を発表・共有する。実践を通じて、技術の進化に適応する力を身につける。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-1200-016",
    "code": "INF-2-C3-1200-016",
    "name": "3Dモデリング技術演習",
    "description": "Blenderを活用した3Dモデリング技術の基本を身につけた上で、キャラクターやオブジェクトの制作に挑戦し、独自の作品を創造する力を養成する。プリミティブモデリングからポリゴン・カーブ・スカルプトモデリング、さらにライティングやカメラ設定を学び、1つの絵画作品として完成させる実践力が身につく過程を体験する。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-1200-017",
    "code": "INF-2-C3-1200-017",
    "name": "ジェネラティブアート演習",
    "description": "Processingを用いたビジュアルプログラミングを学ぶ。基本的な描画方法から始め、色の表現やインタラクティブな要素を取り入れる技術を修得する。アニメーション制作と物理法則の適用を通じて、コードが生み出すダイナミズムを実感する。加えて、画像や音、3Dといった要素を組み合わせて表現力を高める。最終課題に向けた制作活動では、自らのアイデアを形にし、それを他者に伝えるためのプレゼンテーション能力も養う。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-0034-018",
    "code": "INF-2-C3-0034-018",
    "name": "インターネットのしくみ",
    "description": "インターネットを支える技術を演習・ゼミ形式で学ぶ。インターネットのしくみゼミIでは、インターネット基盤技術を構成する最重要要素である、IPアドレスとドメイン名、両者を紐づけるDNSについて幅広く学修する。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-0034-019",
    "code": "INF-2-C3-0034-019",
    "name": "Javaプログラミング演習",
    "description": "オブジェクト指向言語Javaを利用したプログラミングを学ぶ。Javaが持つ基本的な概念や、Javaの持つ繰り返し、データ構造などの基本的な文法、またJavaが持つ標準APIなどを学ぶだけではなく、最新のJavaの機能のStreamなどの高度な利用方法も学ぶ。オブジェクト指向プログラミングの要素を学んだ後ビルドツールや単体テスト、IDEやバージョン管理法も知り、JavaでのWebアプリケーションとデータベースの連携までを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-0034-020",
    "code": "INF-2-C3-0034-020",
    "name": "Webセキュリティ演習",
    "description": "比較的身近であり重要なメディアであるWebのセキュリティを題材に、具体的な対象を情報セキュリティに共通する観点である、目的（機密性、完全性、可用性）と手段（認証・認可・監査）、そしてシステム的視点（経済・人間・法律とのつながり）と攻撃者の視点から理解する。各回において、①実際に起こった重大インシデントの紹介とその被害の影響②実験環境でのインシデントの体験③対策の概要の理解④対策の限界を取り上げる。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-0034-021",
    "code": "INF-2-C3-0034-021",
    "name": "デジタルイラスト演習基礎",
    "description": "CLIP STUDIO・Photoshopを使ったプロのイラスト制作に必要な\n・基礎的技術力・審美眼・作品の抽象化と再構築能力・アルゴリズムの読み解き\n・感覚の言語化・歴史的アート・エンタメ文脈の理解・現代の消費欲求とニーズの理解\nを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-0034-022",
    "code": "INF-2-C3-0034-022",
    "name": "AIアルゴリズム実践",
    "description": "現在、国内外でさまざまな機械学習コンペティションが開催されており、公開されているさまざまなノートブックは、さまざまなデータ分析課題を解く上で大きなヒントを与えてくれる。そこでこの授業では、機械学習コンペティションを通して実践的なデータ分析技術を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-0034-024",
    "code": "INF-2-C3-0034-024",
    "name": "マーケティング × データサイエンス",
    "description": "マーケティングはいま統計学が積極的に活用されている分野の一つである。特にアンケート解析や、口コミ分析といった自然言語データ解析はマーケティングサイエンス領域ではとても重要になっている。\n本授業では、そのようなマーケティングサイエンスの実践的な知識を学び、最先端のデジタル・マーケティングで何が行われているか総体を理解し、自らも解析業務に携われるようになる基盤を構築する。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-1200-014",
    "code": "INF-3-C3-1200-014",
    "name": "ゲームプログラミング演習",
    "description": "この科目では、Unityというゲーム制作ツールを使って2D/3Dゲームの制作やVR/ARの開発の手法を学修する。作成するゲームは、初心者でも簡単に作れるものから徐々に難易度を上げ、より複雑なものに挑戦する。プロフェッショナルなゲームクリエイターが使う技術や手法を習得し、自分の思い描いたゲームを実現するために必要な技術を身につけることができる。また、Unityを通じて多くの学びがあり、ゲーム制作に必要な様々な概念やツールも理解できるようになる。楽しく学びながら、自分自身でアイデアを形にできる力を身につける。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-1200-015",
    "code": "INF-3-C3-1200-015",
    "name": "チームプログラミング演習",
    "description": "本科目は、チーム開発を行いながら課題として設定されたWebアプリケーションを開発し、リリースすることを目的とする。各回ではチームにおいて、技術調査・企画制作、企画レビュー、設計レビューなどをしていきプロダクト開発に挑む。本科目を修了することで、チーム開発で生じる問題やその解決方法について理解できるようになる。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-1200-016",
    "code": "INF-3-C3-1200-016",
    "name": "プロジェクトマネジメント応用",
    "description": "プロジェクトマネジメント概論で学修した知識を用いて、初めて行うプロジェクトに適用し、実践を通じて学修する。演習形式で進め、プロジェクトの目標設定からニーズ把握、計画作成、スケジューリング、リスクと品質の検討、見積り、そして計画書作成までの一連のプロセスを体験する。作業の実施、進捗の確認、レビューを経て、最終的には自身が行ったプロジェクトについてプレゼンテーションを行う。これらの過程を通じて、プロジェクトマネジメントの各段階で必要な知識と技術を深め、実際の現場での応用力を鍛えることを目指す。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-0034-017",
    "code": "INF-3-C3-0034-017",
    "name": "Webアプリケーション開発演習",
    "description": "本授業では、最初から一つのWebアプリケーションを作り上げる流れを体験する。手始めに、各自で興味あるテーマを選び、そのテーマに基づくWebアプリの企画を行う。次にその企画を皆でレビューし、良い点と改善点を探る。その後、改善された企画に基づき、設計レビューを行い、完成形を見据えながらアプリケーションの骨組みを組み上げる。その骨組みを基にして実際の開発に移り、試行錯誤しながらアプリを完成させる。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-1200-018",
    "code": "INF-3-C3-1200-018",
    "name": "動画クリエイター技術演習",
    "description": "Adobe Premiere ProとAfter Effectsの基本的な操作を学び、実際に動画制作を行いながら動画制作に関する基礎的な技術を学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-1200-019",
    "code": "INF-3-C3-1200-019",
    "name": "Webデザイン演習",
    "description": "Webサイト制作に必要な基礎知識や、写真加工やイラスト作成を行うグラフィックツールの使い方、ノーコードのWebサイトビルダーの使い方を学び、実際にWebサイト制作を行う。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-1200-020",
    "code": "INF-3-C3-1200-020",
    "name": "デジタルイラスト演習発展",
    "description": "CLIP STUDIO・Photoshop・Illustratorを使ったプロのイラストレーターとして活動するためのポートフォリオ完成を目指す、それと並行して\n業界就職組：ポートフォリオマッチングサービスの活用、SNS運用方法、内定者PFとの比較分析、業界ニーズへの対応方法\n個人活動組：セルフプロデュースの仕方、実績の作り方、キャリアプランニング\nを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C3-0034-021",
    "code": "INF-3-C3-0034-021",
    "name": "共創場デザイン演習",
    "description": "パターン・ランゲージやアジャイルソフトウェア開発の歴史に触れ、Wiki、ニコニコ動画、ニコニコ学会β等のメディアの発展について学ぶ。これらの知識を活かし、共創型イノベーションや新たな活動立ち上げについて探求する。各学生は自身が取り組む活動計画を立て、中間及び最終発表を行い、アイデアを共有し、他者からのフィードバックを受ける。",
    "credits": 2.0
  },
  {
    "id": "INF-3-C4-1234-024",
    "code": "INF-3-C4-1234-024",
    "name": "ゼミ（インターネットのしくみ（応用））",
    "description": "本ゼミでは、インターネットのしくみにて学んだ基礎知識をベースにIPアドレスの宛先制御について学ぶ。インターネットの宛先制御はすべてのインターネット通信の基本をなすものであり、唯一の宛先制御プロトコルBGPとその関連するテクノロジーを学修する。またゲストを呼んで演習する回も実施する。",
    "credits": 4.0
  },
  {
    "id": "INF-3-C4-1234-025",
    "code": "INF-3-C4-1234-025",
    "name": "ゼミ（質的データ分析&エージェントシミュレーション）",
    "description": "本ゼミでは、質的データ分析とエージェントシミュレーションについて実践を通じて学修する。ただし、本ゼミの目的は、質的データ分析およびエージェントシミュレーションを使えるようになることではなく、そのことを通じて、人間は、どのように社会や世界を見て、社会を認識しているのか、また、この宇宙はどのような構造で成り立っているのかを理解していくことにある。私たちが生活しているこの宇宙、そして、人間の認識について理解が進むと、様々な仕事に応用できるようになる。また、イノベーションを創出したり、新製品の開発などにも役立つ。\n具体的には、前半では、インタビューやインターネット上にある文章（質的データ）をもとに、そこで語られている概念を抽出し、モデル図を作成する方法について学修する。後半では、シンプルなルールが、世の中の複雑な現象を生成している様子をシミュレーションを通じて確認する。",
    "credits": 4.0
  },
  {
    "id": "INF-3-C4-1234-026",
    "code": "INF-3-C4-1234-026",
    "name": "ゼミ（情報セキュリティ）",
    "description": "情報セキュリティに関連したテーマを受講者に設定させ、受講者が自ら調査・研究・発表することで、主体的な学修・考察・コミュニケーションを行う力を養う。テーマは情報セキュリティに関連する広いテーマとし、技術的なテーマのみならず、文化・社会・法律・歴史などのテーマも可能とする。",
    "credits": 4.0
  },
  {
    "id": "INF-3-C4-1234-027",
    "code": "INF-3-C4-1234-027",
    "name": "ゼミ（AIデータサイエンス価値創造ゼミⅠ）",
    "description": "このゼミでは、最新の深層学習に関する文献調査によって最新の研究動向を把握し、各人が実際に深層学習に関する研究プロジェクトを遂行する。ゼミの前半では各人で興味があるトピック・テーマをもとに複数の論文を選択し、各週で担当に割り当てられた学生がその内容について包括的に発表する。後半では、自身が調査したトピックにおける研究テーマを設定し、実際に研究を行う。ゼミでは毎週その進捗報告を行い、担当教員からコメントや質疑応答をもらい、作業に反映させながら研究を進めていく。最終回では各人が行なってきた研究について発表を行う。",
    "credits": 4.0
  },
  {
    "id": "INF-3-C4-1234-028",
    "code": "INF-3-C4-1234-028",
    "name": "ゼミ（AIデータサイエンス価値創造ゼミⅡ）",
    "description": "数学発展の歴史を辿り、社会にデータサイエンス・AIなど数理が深く入り込んでいる現状に照らし、ロジカルシンキングなど昨今さまざまな思考方法に耳目が集まっているなかで『数学的思考法』という思考パターンを定義付け、どのように物事を捉え深掘りしていくかの方法論を学ぶ。数学の歴史からその発祥のありさま、発展の状況、具体的なアウトプットの広がりに至る迄、多面的に学ぶ。ビジネスでのデータ解析事例を学ぶことで、具体的な考え方のコツを掴み、他の思考方法との類似点・相違点を考察することで、受講生が縦横に使いこなせる思考法として修得できるようにする。",
    "credits": 4.0
  },
  {
    "id": "INF-4-C4-1234-001",
    "code": "INF-4-C4-1234-001",
    "name": "ゼミ（メディアアート）",
    "description": "メディアアートというアートの一分野について学び、理解し、独自の視点から表現する力を養う。まずはアートにおけるアイデアの出し方から学び、2回目からは制作とプレゼンテーションを繰り返す。中間と最終でプレゼンテーションを行う。自身の制作物を他者に説明し、評価してもらう機会を設ける。制作過程で必要となる資料収集や、修正と仕上げ、展示計画についても経験する。評価は、制作物が100％となる。",
    "credits": 4.0
  },
  {
    "id": "MTH-1-C3-0034-009",
    "code": "MTH-1-C3-0034-009",
    "name": "数理科学発展演習Ⅰ",
    "description": "この授業では「解析学１」「線形代数１」「解析学２」「線形代数２」に対応した演習を行う。数理系学問の理解を深めるためには、基礎演算力を高めることが必要である。各回の演習では、問題の解法について学修する。",
    "credits": 2.0
  },
  {
    "id": "MTH-1-C3-0034-010",
    "code": "MTH-1-C3-0034-010",
    "name": "Inter-universal Teichmüller Theory 1（宇宙際タイヒミューラー理論 1）",
    "description": " [INTRODUCTION TO NUMBER THEORY]\nintroduction to number theory, starting with basic fundamental notions.\n\n(日本語)\n[数論入門]\n数論の入門として、基礎的な根本概念をレクチャーする。\n（なお、この授業は英語で開講する。）",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C3-1200-009",
    "code": "MTH-2-C3-1200-009",
    "name": "数理科学発展演習Ⅱ",
    "description": "この授業では「集合と論理」「数理構造の発見と活用」「距離空間」に対応した演習を行う。数理系学問の理解を深めるためには、論理的な証明を記述する能力が必要不可欠である。各回の演習では、数学的命題の証明をどのように記述するかを学ぶ。",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C3-1200-010",
    "code": "MTH-2-C3-1200-010",
    "name": "Inter-universal Teichmüller Theory 2（宇宙際タイヒミューラー理論 2）",
    "description": " [ALGEBRA AND GEOMETRY FOR NUMBER THEORY]\nIUT 2 provides more information on basic number theory, commutative algebra, geometry and elliptic curves.\n\n(日本語)\n[数論のための代数と幾何]\n本授業では、基本的な、数論、可換代数、幾何学、および楕円曲線の概念に関して、IUT1よりもさらに詳しい内容を学ぶ。\n（なお、この授業は英語で開講する。）",
    "credits": 2.0
  },
  {
    "id": "MTH-2-C3-0034-011",
    "code": "MTH-2-C3-0034-011",
    "name": "Inter-universal Teichmüller Theory 3（宇宙際タイヒミューラー理論 3）",
    "description": " [ALGEBRAIC NUMBER THEORY]\nIUT 3 presents fundamental features of Galois theory and algebraic number theory. This approach leads to understanding of certain arithmetical properties of numbers (in particular, integers) from a new point of view. For example, various diophantine problems (eg sums of squares) can be interpreted in terms of certain algebraic relations and then successfully solved. IUT3 discusses some of the central results in the theory such as Galois groups, integrality, the structure of their rings of integers, ideal classes and unique factorisation, and applications. \n\n(日本語)\n[数論幾何]\nIUT3（本授業）では、ガロア理論と代数的整数論の基本的な特徴を紹介する。数（特に整数）のある算術的性質を新しい視点から理解できる。例えば、様々なディオファントス問題（例えば、平方数の和）は、特定の代数的な関係性の観点から解釈でき、解決可能である。また、ガロア群、整数性、整数環の構造、イデアル類と一意分解、および応用など、いくつかの中心的な結果について議論する。\n（なお、この授業は英語で開講する。）",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-0034-009",
    "code": "MTH-3-C3-0034-009",
    "name": "環論",
    "description": "本格的な抽象代数学の基礎科目として、整数全体や多項式全体などのような足し算＋と掛け算・の2つの演算がある代数系である「環」について学ぶ科目である。イデアル論や素元分解の一意性など、環論（特に可換環論）の初歩的事実について系統的に修得することを目的とする。本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-1200-010",
    "code": "MTH-3-C3-1200-010",
    "name": "組合せ論",
    "description": "組合せ論とは有限集合に入る構造の研究である。有限的な対象は考察すべき可能性が有限通りに限られるため一見扱い易そうに感じられるが、独特な難しさや奥深さを持っている。近年は応用的な側面でも組合せ論の考え方の重要性は増している。この授業では組合せ論の基本概念や良く使われる手法について出来るだけ系統的に紹介したい。\n本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-0034-011",
    "code": "MTH-3-C3-0034-011",
    "name": "トポロジー",
    "description": "トポロジー（位相幾何学）は連続変形の下で変化しない図形の性質を研究する幾何学である。トポロジーの考え方は定量的性質よりも定性的性質に注目する点で、現代数学における極めて重要な考え方を提供している。この授業ではトポロジーを学ぶために必要な基本的概念を紹介し、位相不変量の初歩として基本群とホモロジー群の計算方法を扱う。\n本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-1200-012",
    "code": "MTH-3-C3-1200-012",
    "name": "積分と測度",
    "description": "古代の測量術に始まり、微分とともに近代科学の基盤となった積分の概念は、数多くの数学者の努力を経て厳密かつ実用的なものとなった。本授業においては、積分を「線型汎関数」として捉える立場から、確率論や統計学を始めとする数多くの学問領域において重要な「ルベーグ積分」や「測度」の理論を学んでいく。その過程で、量子論の基礎数理とも関係し近年では機械学習等の応用においても存在感を増す「関数解析」の考え方にも親しんでいく。\n本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-1200-013",
    "code": "MTH-3-C3-1200-013",
    "name": "Inter-universal Teichmüller Theory 4（宇宙際タイヒミューラー理論 4）",
    "description": " [FROM CLASS FIELD THEORY OF ANABELIAN GEOMETRY AND IUT]\nThis most advanced part of IUT courses, IUT4 will present areas of modern number theory related and used in the IUT theory, they include some of class field theory, anabelian geometry, and IUT.       \n\n(日本語)\n[遠アーベル幾何とIUTの類対論]\nIUTコースの最も進んだ部分であるIUT4（本授業）では、IUT理論に関連し、使用されている現代の数論の分野を紹介する。それらには、類体論、遠アーベル幾何学、およびIUTが含まれている。\n（なお、この授業は英語で開講する。）",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-0034-014",
    "code": "MTH-3-C3-0034-014",
    "name": "量子コンピュータ演習",
    "description": "スパコンより桁違いに高速な計算が実行できる可能性を秘めた量子コンピュータ。この動作原理、アルゴリズム、そしてプログラミング手法を取り上げる。座学と実践を組み合わせた本授業を通して、量子プログラムを設計、実装、実行する能力を養う。本授業は線形代数の知識が前提となり、量子物理学の知識は（あれば理解の助けになるが）必要としない。基本事項を座学で講義した後、実際にいくつかのアルゴリズムの実装実習を通じて、量子プログラムを読み解き、実装する能力を高める。",
    "credits": 2.0
  },
  {
    "id": "MTH-3-C3-1200-015",
    "code": "MTH-3-C3-1200-015",
    "name": "Wolfram言語で学ぶ科学計算",
    "description": "この授業はWolfram言語を使って科学計算を学ぶもので、数字と数式の計算、計算結果の視覚化、シミュレーション、グラフィックス、自由研究・発表などが扱われる。Wolfram言語は数学に特化した言語であり、学生はアカウントの取得方法のような基礎から学修することができる。",
    "credits": 2.0
  },
  {
    "id": "MTH-4-C3-1200-001",
    "code": "MTH-4-C3-1200-001",
    "name": "ガロア理論",
    "description": "なぜ5次以上の一般代数方程式は代数的な解の公式（あるいは解き方の手順）をもたないのか？このシンプルな問いに対する深遠な解答がガロア理論である。この科目ではガロア理論の本質を理解することを目標とする。\n本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-4-C3-1200-002",
    "code": "MTH-4-C3-1200-002",
    "name": "数理論理学",
    "description": "数理論理学を学ぶ上で基本的となる事項を学修する。まず一階述語論理の証明体系の例として自然演繹の体系NKを導入した後、論理式の解釈を定める「構造」を定義し、一階述語論理の完全性定理を証明する。授業の後半ではゲーデルの不完全性定理について、主張の意味するところと証明の概略を解説する。\n本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-4-C3-0034-003",
    "code": "MTH-4-C3-0034-003",
    "name": "量子からはじまる確率論",
    "description": "この世界に溢れる「確率的な現象」を捉えるための数学的理論が確率論であり、現代において確率論といえば通常は「測度論的確率論」を意味する。しかし、測度論的確率論は量子現象における「確率的な現象」をモデル化するには十分でないことが知られている。本授業では、測度論的確率論や量子論をその一部に含むほどに一般化された確率論である「非可換確率論」（量子確率論・代数的確率論とも呼ばれる）を、測度論的確率論や量子論の知識を前提とせずに学ぶ。非可換代数とその上の「状態」の概念を出発点にして量子論のエッセンスをつかみ、ヒルベルト空間などの解析に必要な数学的な道具立てに馴染んでいく中で、測度論的確率論・組合せ論・ネットワーク科学など関連する様々な分野の考え方をも身につけていくことを目指す。\n本科目は演習科目に位置付けられ、学生の積極的な参加、問題演習への取り組みが求められる。",
    "credits": 2.0
  },
  {
    "id": "MTH-4-C4-1234-004",
    "code": "MTH-4-C4-1234-004",
    "name": "ゼミ（数理科学特論ゼミⅠ）",
    "description": "このゼミは、専門教育の最後の総仕上げとして位置づけられている。各人が専門書を読み、毎週担当教員の前で解説する。通常、2〜3人のグループを組み、担当教員から指導を受ける。専門書には詳細な説明が与えられていない場合もあり、論理の飛躍を埋め、整然とした解説を行う必要がある。そのためには、毎回の予習が重要であり、これまでの復習や未習事項の学修が求められる。",
    "credits": 4.0
  },
  {
    "id": "MTH-4-C4-1234-005",
    "code": "MTH-4-C4-1234-005",
    "name": "ゼミ（数理科学特論ゼミⅡ）",
    "description": "このゼミは、専門教育の最後の総仕上げとして位置づけられている。各人が専門書を読み、毎週担当教員の前で解説する。通常、2〜3人のグループを組み、担当教員から指導を受ける。専門書には詳細な説明が与えられていない場合もあり、論理の飛躍を埋め、整然とした解説を行う必要がある。そのためには、毎回の予習が重要であり、これまでの復習や未習事項の学修が求められる。",
    "credits": 4.0
  },
  {
    "id": "MTH-4-C4-1234-006",
    "code": "MTH-4-C4-1234-006",
    "name": "ゼミ（数理科学特論ゼミⅢ）",
    "description": "このゼミは、専門教育の最後の総仕上げとして位置づけられている。各人が専門書を読み、毎週担当教員の前で解説する。通常、2〜3人のグループを組み、担当教員から指導を受ける。専門書には詳細な説明が与えられていない場合もあり、論理の飛躍を埋め、整然とした解説を行う必要がある。そのためには、毎回の予習が重要であり、これまでの復習や未習事項の学修が求められる。",
    "credits": 4.0
  },
  {
    "id": "MTH-4-C4-1234-007",
    "code": "MTH-4-C4-1234-007",
    "name": "ゼミ（数理科学特論ゼミⅣ）",
    "description": "このゼミは、専門教育の最後の総仕上げとして位置づけられている。各人が専門書を読み、毎週担当教員の前で解説する。通常、2〜3人のグループを組み、担当教員から指導を受ける。専門書には詳細な説明が与えられていない場合もあり、論理の飛躍を埋め、整然とした解説を行う必要がある。そのためには、毎回の予習が重要であり、これまでの復習や未習事項の学修が求められる。\n（なお、この授業は英語で開講する。）",
    "credits": 4.0
  },
  {
    "id": "MTH-4-C4-1234-008",
    "code": "MTH-4-C4-1234-008",
    "name": "ゼミ（量子科学技術）",
    "description": "このゼミでは、量子計算や量子物理学に関連する事柄について、理論的な研究課題を設定し、課題に取り組み、その結果を発表するための基礎力を養成する。前半では、必要となる基礎知識を専門書や論文を批判的に読むことで身につける。後半では、教員との対話を通じて課題を設定し、進捗報告とフィードバックを繰り返し、課題解決を図る。最後に、得られた研究成果または身につけた専門知識を資料にまとめて、最終成果物とする。優れた成果は学会等の対外発表を行う。",
    "credits": 4.0
  },
  {
    "id": "HUM-1-C3-0034-007",
    "code": "HUM-1-C3-0034-007",
    "name": "生きてゆくための禅",
    "description": "コミュニケーション・プレゼンテーションの能力、食やアートなどの文化を理解し、他人と共有する力－－社会で活躍するために必要なスキルは数々あるが、そのスキルを使う主体である「自分」とは何か？　坐禅と対話を通じた演習により「本当の自分」について考察してゆく。",
    "credits": 2.0
  },
  {
    "id": "HUM-1-C3-0034-008",
    "code": "HUM-1-C3-0034-008",
    "name": "政治を超える哲学Ⅰ",
    "description": "現代世界は政治に満たされている。哲学も政治の道具となっている。しかし、そもそも哲学とは「政治の外」を考える営みであり、また人間を政治から自由にする手段でもあった。\n本授業では、講師の著作を導入として、そんな哲学の役割をあらためて考えるための基礎文献を紹介する。学生は現代思想の基礎概念（ポストモダン、公共性、リベラリズムなど）も学ぶことができる。\n授業は基本的に講義形式だが、各回必ず質疑応答時間を取る。積極的な質疑は評価の対象となる。また学生発表を組み込んだ回も入れる（発表内容は別途授業内で指示する）。発表も評価点に加わる。なお、紹介する文献、学生発表の対象とする回などは授業の進行に応じて変更される可能性がある。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C3-1200-009",
    "code": "HUM-2-C3-1200-009",
    "name": "政治を超える哲学Ⅱ",
    "description": "現代世界は政治に満たされている。哲学も政治の道具となっている。しかし、そもそも哲学とは「政治の外」を考える営みであり、また人間を政治から自由にする手段でもあった。\n本講義では、「政治を超える哲学Ⅰ」を踏まえたうえで、まず言語ゲーム論を学び、つぎにルソーとドストエフスキーという2人の古典を読みながら、「政治」と「その外部」について考える。学生は政治思想の基礎概念（一般意志）やロマン主義文学の基礎的な知識も学ぶことができる。\n授業は基本的に講義形式だが、各回必ず質疑応答時間を取る。積極的な質疑は評価の対象となる。また学生発表を組み込んだ回も入れる（発表内容は別途授業内で指示する）。発表も評価点に加わる。なお、紹介する文献、学生発表の対象とする回などは授業の進行に応じて変更される可能性がある。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C3-1200-010",
    "code": "HUM-2-C3-1200-010",
    "name": "社会で活きる囲碁論",
    "description": "囲碁の理念から歴史、エンタテインメントとの関係性、最新のAIと囲碁の関係について学び、文化としての囲碁を深く理解する。また、勝敗の概念、大局観など囲碁の存続の背後にある普遍的な価値について学ぶ。実際に触れる対局やプロの対局の観戦は、それらの価値観や文化論により深い理解をもたらすであろう。さらに、クリエイターや経済人など異なった知見を持つゲストとの対話を通じて多角的な視野から囲碁を学ぶ演習授業である。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C3-1200-011",
    "code": "HUM-2-C3-1200-011",
    "name": "心理学実験・調査演習",
    "description": "科学的心理学では、行動を通して人の心の働きを推測することを目指す。そのための研究手法として、実験や調査がある。本授業では、心理学実験や調査を自分たちで実施して、得られたデータを分析しレポートにまとめることを体験する。そのためには、データの分析方法、レポートの作成方法の基本も学ぶ必要がある。これらの学びと体験を通して、心理データの収集の実際を知り、データから結論を導くスキルを習得する。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C3-0034-012",
    "code": "HUM-2-C3-0034-012",
    "name": "WEBコミック演習",
    "description": "現在、まんがは紙のまんがに加え、縦スクロールまんがなどweb上のまんがの形式がいくつか存在し、まんが表現はweb上で日々変化している。まんがの表現方法は器となるデバイスによって変化するため、この演習では、まんがの作り方で学んだ理論を実践し、紙のまんが作品を作り、webまんがへ変換する。添削を交え「見開きのまんが」を「縦スクロール」に書き換える（アダプテーションする）実験を実際に行い 、また、web１頁まんが、１頁イラストまんがなどのwebの新しいまんが表現も実践、研究する。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C3-0034-013",
    "code": "HUM-2-C3-0034-013",
    "name": "こころの成り立ちとメンタルヘルス",
    "description": "多様化、複雑化する現代社会では、さまざまな形でメンタルヘルスの問題が生じており、社会的リスク要因となっている。この授業では精神分析的なこころの発達理論を概説し、セルフチェック、グループ・ディスカッション、自身の発達の振り返りを通して、健康なこころの成長発達の過程を体験的に理解する。さらに健康な発達が阻害されたときに、どのような問題が発生し、個人、家族、社会集団にどう現れるかを知り、対処と解決方法を考える。",
    "credits": 2.0
  },
  {
    "id": "HUM-2-C3-0034-014",
    "code": "HUM-2-C3-0034-014",
    "name": "ウェルビーイングをデザインする",
    "description": "“妊娠前の健康管理”として成立したプレコンセプションケアは、現在では若い世代がリプロダクティブ・ウェルビーイングを得ることも目的に加わっている。将来、妊娠・出産や子ども持つ/持たないを一度は真剣に考え、そのうえで真に健康に生きるために必要なこと、またそれを実践していくことの重要性やエッセンスを学ぶ演習授業である。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C3-1200-003",
    "code": "HUM-3-C3-1200-003",
    "name": "芸術と文化資本Ⅱ",
    "description": "アートとアートマネジメント、それらを支える文化資本との関係について検証していく。アート作品（映画など商業コンテンツを含む）も市場で取り引きされる動産の一種なので、取り引きの活性化のために絶え間ない投資が必要となる。そして、投資額が大きい程、市場規模が大きくなることも他の動産取り引きと変わりない。美術館やアートフェアも、美術作品の価値を高めるための装置であることを知る。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C3-1200-004",
    "code": "HUM-3-C3-1200-004",
    "name": "日本文学Ⅲ",
    "description": "急速にグローバル化が進む現代社会の中で活躍するために、国境を越えた国々、文化、世界観についての知識が不可欠である。本授業では、海外で読まれた具体的な日本文学作品を取り上げ、比較考察の方法を通して、文化の流通と変容の詳細な過程について考えたい。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C3-0034-005",
    "code": "HUM-3-C3-0034-005",
    "name": "文化人類学Ⅲ",
    "description": "ファン文化と参加型文化の研究は、趣味との関わり、人との関わり、そしてこれを可能にする情報技術とコミュニケーションの研究である。本授業においては、コスプレ、同人活動やボーカロイドなどから例を取り上げて、特にインターネット空間におけるファン活動、コミュニティ作りやネットワーク作りなどに焦点を当てる。グループワークで関心のあるファン文化を考察し、ファン文化研究と参加型文化の基礎を身につける。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C3-0034-006",
    "code": "HUM-3-C3-0034-006",
    "name": "AI時代の科学と哲学",
    "description": "深層学習に代表されるAI技術は、我々の日常や社会生活だけでなく、今後の科学のあり方をも大きく変えていくことが予想される。本授業では、近代科学の根底にある「合理的で、客観的で、万人にとって有用である」という理念の成り立ちを確認した上で、来るべきAI駆動科学が従来のこうした科学観にどのような影響を与えていくか、ということを考える。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C3-0034-007",
    "code": "HUM-3-C3-0034-007",
    "name": "フィールドワークで学ぶ宗教思想史",
    "description": "本科目では、縄文時代の信仰と天文学について学修する。狩猟・採集に依存していた人々は、四季の変化に応じて食糧を確保する必要があり、太陽や星の観測は極めて重要だった。その痕跡は、全国の遺跡や神社の位置に隠されている。受講者はフィールドワークを通じて、日本人の自然との関わりと、信仰の起源について考察を深めることを目的とする。",
    "credits": 2.0
  },
  {
    "id": "HUM-3-C4-1234-008",
    "code": "HUM-3-C4-1234-008",
    "name": "ゼミ（心の科学）",
    "description": "前提科目である心理学実験・調査演習で学んだ心の科学の研究方法を踏まえ、与えられた実験・調査材料を使ってそれらを実施するだけでなく、自分たちで実験や調査を構築し、研究上の問いに答えを導くプロセスを体験することを目標とする。そのため、研究内容の決定、それを実施するための資料作成とプログラミングなどの準備を主体的に行なってもらう。構築された実験・調査を実施し、データを収集し、得られたデータから問いへの答えをプレゼンテーションとレポートにまとめる。",
    "credits": 4.0
  },
  {
    "id": "HUM-3-C4-1234-009",
    "code": "HUM-3-C4-1234-009",
    "name": "ゼミ（物語創作と物語の構造分析）",
    "description": "神話学・民俗学・心理学・ハリウッド映画のシナリオ論等の「物語論」を踏まえ前半１５回は「構造」からプロットを演繹的に制作、後半は任意の作品から帰納的に物語構造を分析する。毎回、制作あるいは分析の手法を実際に示し、課題とし、次回に提出された課題を受講生とともに講評・討議していく。また創作・分析に生成AIの進化に応じどこまで援用可能か必要に応じ関連する専門家の講評・討議への参加を仰ぐ。",
    "credits": 4.0
  },
  {
    "id": "HUM-3-C4-1234-010",
    "code": "HUM-3-C4-1234-010",
    "name": "ゼミ（トークイベントをつくる）",
    "description": "ソクラテスは哲学は産婆術に似ていると述べた。人々がアイデアを生み出すのを助ける術だという意味である。\n本ゼミでは、グループワークを通して、そのような意味での哲学の場、すなわち「人々がアイデアを生み出すのを助ける場」の創出方法を実践的に学ぶ。講師は東京で2013年より「ゲンロンカフェ」というイベントスペースを経営している。その経験を活かし、企画力・交渉力・司会力など多面的な観点から、トークイベントの制作方法を伝授する。最後には実際に学生主体で「公開のトークショー」を企画運営してもらい、最終成果とする。",
    "credits": 4.0
  },
  {
    "id": "HUM-4-C4-1234-001",
    "code": "HUM-4-C4-1234-001",
    "name": "ゼミ（展覧会のつくりかた）",
    "description": "美術館で私たちが見る展覧会はどのように設計されているのだろうか？　展覧会の企画で最も重要なことは今の時代に相応しいテーマを設定することである。アートを語彙として行なうコミュニケーションでは世の中で起きていることを抽象化して説明する能力が求められる。授業の進め方として、ディスカッションが重要なのでグループ・ワークが中心となる。必要に応じてゲストを招いてお話をうかがう。",
    "credits": 4.0
  },
  {
    "id": "HUM-4-C4-1234-002",
    "code": "HUM-4-C4-1234-002",
    "name": "ゼミ（文芸批評論）",
    "description": "本授業では、国内外からの具体的な文学作品を取り上げ、文学作品の分析のために使われる主な文学理論について学ぶ。我々は単なる娯楽として読む文学作品を文学理論を使って批判的に解読することで、社会と文化の関係性について理解し、文学はいかにしてより良い社会づくりに貢献できるのかについて知識を得る。",
    "credits": 4.0
  },
  {
    "id": "HUM-4-C4-1234-003",
    "code": "HUM-4-C4-1234-003",
    "name": "ゼミ（ファン文化論を捉えなおすための参加型文化論）",
    "description": "ファン文化論を概観し、今までのファン文化論を新たな角度から捉え直すことを目指し、隣接の人文社会科学（文化人類学や社会学、文学、情報学）の概念、研究手法や方法論を用いて、学際的なスタンスから、現在の参加型文化（活動と文化）の調査を指導する。経験と議論の積み重ねから、これまで学んできた文化人類学やファン文化研究の概念などを学生が自身の課題に沿って捉えなおすことで、研究力を身につける。",
    "credits": 4.0
  },
  {
    "id": "HUM-4-C4-1234-004",
    "code": "HUM-4-C4-1234-004",
    "name": "ゼミ（数理哲学）",
    "description": "一般に哲学は数学とは「水と油」のような関係だと考えられている。しかしこれは全くの間違いである。理論的思考を突き詰める哲学的思索には、数学と相通じるところが多くある（実際、デカルトやライプニッツなどの哲学者は、同時に数学者でもあった）。本ゼミでは、そのようなスピリットのもと、「哲学を数学的に行う」ことを演習形式で体得することを目指す。哲学的問題の数理モデリングに関するオリジナル教材を使用し、様々な数理的手法の「使い方」を体得するとともに、グループワーク等を通じて、そうした手法を用いて哲学的問題を自分でモデリングできるようになることを目指す。",
    "credits": 4.0
  },
  {
    "id": "SOC-2-C3-1200-010",
    "code": "SOC-2-C3-1200-010",
    "name": "社会学Ⅲ",
    "description": "「社会を変える」「社会を変えなければならない」\n誰もがこのような言葉を一度は聞いたことがあるだろう。あるいは、「社会を変えたい」と思っている人も多くいるかもしれない。\n本当に「社会を変えたい」と思ったら、一度立ち止まって「社会を変える/社会が変わるとはどういうことか？」ということについて真剣に考える必要がある。この授業では、「社会を変える/社会が変わる」ということについて多様な観点から検討していく。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-1200-011",
    "code": "SOC-2-C3-1200-011",
    "name": "現代スポーツ構造分析",
    "description": "現代社会は、ギリシャのポリス制の頃に似てきた。ギリシャでは労働は奴隷に任せ、市民はコロシアムで演劇や格闘技を楽しんでいた。現代社会はコンピュータに全てを委ねてスポーツやフェスをメディアと実物で楽しむ社会になりつつある。スポーツは、その存在意義が過去にないほどに増大しつつある。本講では現代におけるスポーツの現在形をいろいろな角度からフィールドワークしてスポーツの今日の全体像を把握することを目的とした内容である。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-1200-012",
    "code": "SOC-2-C3-1200-012",
    "name": "SFから考える未来ビジョン",
    "description": "サイエンスフィクション（SF）が近年ビジネス業界で注目されています。様々な人を集め一緒にSFを作ることで、どんな未来が来るのか議論したり、やりたいことを新しく考えたりするメソッドが様々な現場で取り入れられているのです。本授業では、参加型ワークを通してこのメソッドを体験して頂き、自分自身のキャリアやビジネスをこれまでにない斬新なものとして打ち出していくためのコツを教えます。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-0034-013",
    "code": "SOC-2-C3-0034-013",
    "name": "現代社会理論",
    "description": "経済学や政治学ではまず「個人」を想定して、その選択と行為の集まりとして社会を考える。しかし社会学には、そうした考え方をとらない理論の蓄積がある。この授業では学生と教員のオンラインでの双方向対話を重視しながら、そのような社会学の諸理論を学び、その発想法を修得させる。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-0034-014",
    "code": "SOC-2-C3-0034-014",
    "name": "未来社会デザイン論",
    "description": "「石器時代が終わったのは石がなくなったからではない」（鉄器などより良いものが創られたからだ）――同様に石油時代も石油の枯渇を待たずに終わるだろう。この言葉は、時代を開くのが資源の「有限性」でなく人間の「創造性」であることを示唆している。イノベーションがすべてを解決するというナイーブな技術信仰ではない。だが21世紀を生きる世代としての想像力を、無意識のうちに20世紀の常識で縛ってはいないか？本講はそんな「心の脱衣」のトレーニングである。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-0034-015",
    "code": "SOC-2-C3-0034-015",
    "name": "音楽と社会",
    "description": "音楽はどのように社会と切り結ぶのか。音楽から我々は何を得ているのか。指揮者／エル・システマジャパン音楽監督としての実体験も踏まえつつ、主にクラシック音楽の分野において、いま参照すべき様々な事例を紹介してゆく。ゲストを交えた対談も適宜行う。講義を通じて、音楽という営みを外に開いてゆきながら、受講者それぞれに「橋」としての音楽の可能性を見出してほしい。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-0034-016",
    "code": "SOC-2-C3-0034-016",
    "name": "子どもと地域づくり",
    "description": "子どもは、地域の将来を担う存在である。子どもという次世代を地域で育む活動として、食を通じたシビックプライドの育成、新しいデザインによる地域の伝統工芸品への愛着育成、防災の取り組みなどがある。\n これらの取り組みは、狭義には子どもの育成であるが、広義には地域づくりである。本授業における「地域づくり」とは、地域社会課題解決に向けた取り組み、地域を担う人の育成や地域の価値創造である。本授業では、さまざまな事例を手がかりに、議論を行い、子どもを通じて地域づくりへの理解を深める。必要に応じ実践者をゲストとして招き、対談、ヒアリングなどの多様な方法で実践の本質を学ぶ。本授業が対象にする子どもは、小学校中学年以下である。",
    "credits": 2.0
  },
  {
    "id": "SOC-2-C3-0034-017",
    "code": "SOC-2-C3-0034-017",
    "name": "コラボレーション・クリエイティブ",
    "description": "世の中を驚かせるアイデアを生み出し、それをかたちにするためにはどうすればよいでしょうか。\n そのためには、ひとりひとりが「発想する力」と「共創する力」を身につけ、\n 自分なりのアイデアを生み出す方法論とコラボレーションする方法論を作り出すことが必要です。\n 本授業では、すべての人がもっている創造力を掘り起こしながら、\n アイデアを生み出す技術とコラボレーションする技術を体系的に学び、実践活動につなげます。\n ※グループワーク前提の授業になります。基本的に毎回異なるグループを編成しグループワークをおこないます。",
    "credits": 2.0
  },
  {
    "id": "SOC-3-C3-0034-003",
    "code": "SOC-3-C3-0034-003",
    "name": "スマート田舎のススメ",
    "description": "都会とデジタルネットワークで繋がりながら地方で暮らすライフスタイル（スマート田舎）に関心を持つ学生を対象に、半農半X、農業6次産業化、地方型スマートシティなどの事例を踏まえて地域の課題を理解し、解決の方法について学生自身がグループワークを通じて地域の未来像を描き、発表する機会を設けます。\n",
    "credits": 2.0
  },
  {
    "id": "SOC-3-C3-0034-004",
    "code": "SOC-3-C3-0034-004",
    "name": "課題解決と改革のリーダーシップ",
    "description": "本科目では企業や学校、都市や地域などの様々な組織、そして社会や国家が直面する課題を理解し解決するための洞察力を養うとともに、課題解決の方法論を学ぶ。具体的には、事例を手がかりに課題の原因や構造の理解、組織が持つ資産（人材、資金）、外部環境の理解を深めていく。様々な事例をもとに特に課題の掘り下げ方について議論をする。",
    "credits": 2.0
  },
  {
    "id": "SOC-3-C3-0034-005",
    "code": "SOC-3-C3-0034-005",
    "name": "民主主義論",
    "description": "日本は多元的な代表民主主義あるいは自由民主主義および議院内閣制という政治体制をとっています。日本の政治過程は毎年の国会審議や首相官邸と各省庁の政策過程というループもしくはサイクルとして回っているわけです。皆さんにとっては将来的に、この政治のループに何らかの形で関わる能力が大事になります。本授業では「社会に関わる能力」の一環として政治的な実践力を捉え、この観点から日本の政治制度に焦点を当て、関連する政治学、政治哲学、政策決定過程、行財政について説明します。ここでいう政治とは、政府や地方自治体など公的機関（public sector）に関連した活動全般を指しています。現在の政治は、市場経済における企業の活動やインターネット上での市民の活動と密接に結び付いて社会全体の相互作用を作り出しています。このような民主主義のプロセスや政治決定が、どのような形でわれわれの社会生活に結び付いているのか、この授業では具体例を交えて検討します。",
    "credits": 2.0
  },
  {
    "id": "SOC-4-C3-1200-001",
    "code": "SOC-4-C3-1200-001",
    "name": "国際関係論",
    "description": "国際関係論は、主権国家の外交交渉や軍事行動、国際社会の相互依存関係やグローバル化を理論的･実証的に研究する学問領域です。国際関係は帝国による支配や植民地統治、人種主義、戦争と覇権国の交代、核兵器と情報戦争、先進国と途上国の格差、政治的・文化的ナショナリズムといった厄介な問題に結びついています。世界で最初の国際関係論（International Relations）の講座は、第1次大戦後にウェールズ大学のウッドロー・ウィルソン国際政治学講座として設置されました。国際関係理論は、その当時からイデオロギーと世界観によって社会状況の解釈が異なる、ということを前提として作られています。国際関係論では所与の説明のループをどのように批判的に見るのかが重要です。この授業では、英国および米国のアカデミアで発展した国際関係論の主要な理論的枠組み、その研究史と問題関心、これと関連した国際政治や資本主義市場経済の歴史的研究を解説し、批判的な判断の前提となる理論的な素材を提供するものとします。またテーマをやや広く取って、安全保障と軍事、対外政策分析、ODAの実務についても解説します。",
    "credits": 2.0
  },
  {
    "id": "SOC-3-C4-1234-006",
    "code": "SOC-3-C4-1234-006",
    "name": "ゼミ（多様化する家族）",
    "description": "家族とは何か――これは当たり前のようでとても難しい問題である。「婚姻」と「血縁」により親子を決定するというわが国の伝統的な理論のほか、わが国に先立って社会の変化に直面したアメリカを題材に、親となる「意思」で親子を決定するという生殖補助医療法制や、親として「機能」している者を親と認定する理論を検討し、そこに普遍的な親子の要件を探すことを目的とする。ステップファミリー、シングルピアレントや同性カップルによる子育てを含む、多様な家族の形について扱う。",
    "credits": 4.0
  },
  {
    "id": "SOC-3-C4-1234-007",
    "code": "SOC-3-C4-1234-007",
    "name": "ゼミ（情報社会の政治学）",
    "description": "このゼミは「情報社会論」「情報社会と総合安全保障」「民主主義論」「国際関係論」の履修者で、政治や行政の実務、外交･安全保障や軍事の歴史と動向、現在の政治状況や情報社会の調査研究に関心を持つ学生の皆さんを主な対象とします。現在の全般的な政治状況は情報通信技術の進歩と相まってVUCA（Volatility（変動性）、Uncertainty（不確実性）、Complexity（複雑性）、Ambiguity（曖昧性））という以外ありません。複雑な変化のなかにパターンを見出しタイムリーに適切な判断を行う方法論を習うには修羅場を経験した実務家の経験を聞くのがいちばんです。このゼミは鈴木寛先生（元文部科学副大臣・前文部科学大臣補佐官、本学チェアマン）と髙見澤將林先生（元内閣官房副長官補／事態対処・危機管理担当、元ジュネーブ軍縮大使）に分担をお願いしています。年間30回のゼミを以下の3部構成とします。Ⅰ. 情報社会学と社会システム論、Ⅱ. 国際関係論と総合安全保障、Ⅲ. 民主主義の諸理論と組織のガバナンス。各部を講義と基礎論文の購読に分けて、受講生の皆さんと議論しながら授業を進めるものとします。",
    "credits": 4.0
  },
  {
    "id": "SOC-4-C4-1234-002",
    "code": "SOC-4-C4-1234-002",
    "name": "ゼミ（社会学）",
    "description": "この授業では、現代社会の「社会問題」と社会学の古典研究の輪読を行う。年間30回あるうちの15回は現代的な問題を扱い、残りの15回は社会学の古典をとりあげて、参加者とともに議論をおこなっていく。この授業では、なるべく参加者全員に文献のまとめ（レジュメ）を作成してもらい、そのまとめをもとに授業を進めていく予定である。",
    "credits": 4.0
  },
  {
    "id": "SOC-4-C4-1234-003",
    "code": "SOC-4-C4-1234-003",
    "name": "ゼミ（意思決定研究と実践）",
    "description": "意思決定（交渉を含む）分野での研究を1年間かけて行う。意思決定はあらゆる分野に絡むので、学術的な概念でも社会現象の分析も対象にする。また何か実践活動を行っても構わない。領域は経営のみならず政策でもよく、ありとあらゆるテーマを許容する。受講者自身の研究・実践活動なので、あくまで主体は受講者であり、講師は横から手助けをすることに集中する。基本的な講義は、研究の仕方について2回行うだけである。",
    "credits": 4.0
  },
  {
    "id": "SOC-4-C4-1234-004",
    "code": "SOC-4-C4-1234-004",
    "name": "ゼミ（異文化理解）",
    "description": "異文化理解分野での研究を1年間かけて行う。理論研究から社会やビジネスにおける事例分析まで、幅広い視点や多様なアプローチでの研究を促す。学生の自主性を尊重し、学生間の積極的な相互フィードバックやグループでの共同研究などを通じて、協業作業に欠かせないコミュニケーション能力の向上も目指す。希望する学生には、英語文献講読の指導も行なう。",
    "credits": 4.0
  },
  {
    "id": "ECON-2-C3-0034-008",
    "code": "ECON-2-C3-0034-008",
    "name": "現代資本主義論",
    "description": "この演習では、マルクス経済学の手法を用いて、現代資本主義の問題について議論していく。気候変動、AI、戦争、インフレなどの問題を扱う文献を読み、議論していく。「新自由主義」「認知資本主義」「レント資本主義」についてマルクスの分析に照らしながら、考察していく。その際には、マルクスの恐慌論、利潤率の傾向的低下、転形問題などが現代資本主義の問題点を分析するうえで、どれほどの妥当性を持つかについても検討していく。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C3-0034-001",
    "code": "ECON-3-C3-0034-001",
    "name": "マクロ経済分析演習",
    "description": "経済学の基本的概念を理解した上で、国の景気の測り方や経済発展の測定方法について学び、現実のデータをどのように利用するのかを考える。さらに、経済全体の動きを把握する能力を身につけることを目指す。また、実際の経済データを用いた分析方法を学び、その結果に基づいてプレゼンテーションを行い、解釈についての討論を行なう。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C3-0034-002",
    "code": "ECON-3-C3-0034-002",
    "name": "課題解決のための計量経済分析",
    "description": "科学的証拠に基づいた政策立案（EBPM）の基礎的な知識と技法を教える。具体的には、多様な施策の介入効果を正しく評価するための因果推論の考え方を理解し、統計分析ソフトRと模擬データセットを実践的に用いる新しい計量経済学の基礎的手法を演習する。また、効果の検証結果を他人に伝える際のデータビジュアライゼーションの基礎的手法も併せて紹介する。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C3-1200-003",
    "code": "ECON-3-C3-1200-003",
    "name": "事例から学ぶ統計学",
    "description": "経済や経営で使われる統計学の基礎知識やさまざまな統計手法を理解するために不可欠となる理論とその応用について、「基礎編」と「実践編」の二段階に分け指導する。演習では、日常生活において観測できる興味深く具体的なデータを豊富に活用し、統計学の基礎と実践を結びつける訓練を行う。「基礎編」では記述統計、確率と統計の関係などを扱い、「実践編」では確率モデル、時系列データと時系列グラフなどを扱う。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C3-1200-004",
    "code": "ECON-3-C3-1200-004",
    "name": "財務分析演習",
    "description": "いずれは経営者になりたい人、就職先として銀行・証券会社・投資銀行のような金融機関においてアドバイザリー業務に携わったり、コンサルタント・会計士・税理士として企業にアドバイスする専門家になりたい人に財務分析の方法と財務経営の施策の企画方法について教える。財務分析演習では表計算ソフトを使用し、グループによる分析を指導する。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C3-0034-005",
    "code": "ECON-3-C3-0034-005",
    "name": "企業価値創造とM＆A",
    "description": "企業は経営環境の変化に合わせて最適化しなければ生き延びられない。本科目では、企業の最適化のためのＭ＆Ａを使った事業ポートフォリオの最適化や資本構成の最適化について事例の検証を行う。特に、古くからの事業譲渡、合併に加えて、最近導入された株式交換・株式移転や会社分割制度について演習を通じて具体的な理解を養う。日本でもＭＢＯ，ＬＢＯや敵対的買収が起き始めている。資本構成としては、株式公開、債務の株式化の基本を理解してもらう。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C3-0034-006",
    "code": "ECON-3-C3-0034-006",
    "name": "交渉・合意形成演習",
    "description": "「交渉・合意形成概論」の科目で、交渉において戦略的に思考するための基礎知識は提供した。しかし、交渉は実践で使えなければ意味がない。本演習では、交渉のケースを用いて、実際に学生同士（あるいは家族・友人と）交渉をしてもらい、そのプロセスを全員で共有し、さらに議論することで実践的交渉力の向上を図る。",
    "credits": 2.0
  },
  {
    "id": "ECON-4-C3-0034-001",
    "code": "ECON-4-C3-0034-001",
    "name": "スタートアップ実践",
    "description": "参加学生で組んだチームに対し、スタートアップの事業プランの立案を指導する。具体的には、社会課題、地域課題や自らの課題意識といった事業アイディアを具体的な事業コンセプトに育てるプロセスを演習を通じて教示し、その過程では、ユーザーインタビューを通じた仮説検証、ローコード・ノーコードツール、生成AIツールを活用したプロトタイプの作成などを指導する。",
    "credits": 2.0
  },
  {
    "id": "ECON-3-C4-1234-007",
    "code": "ECON-3-C4-1234-007",
    "name": "ゼミ（地域づくり新事業ワークショップ）",
    "description": "最終成果は、地域における課題解決につながる現実性と事業性を両立できるアイデアを作成し、発表することである。文献の輪読と事例のディスカッションを起点に進めるが、最終的には自身のアイデアを授業の中で発表する。考えを深め、その考えを語りかける演習を通じて、地域の多様な人や組織と対話や提案できるようになることを目指す。実践知を育成するためにさまざまな事例を取り上げ、「事例探究」、「グループディスカッション」、「発表と質疑応答」というケースメソッドを用いる。自身の地域事業のアイデアを考えるワークショップを行う。理解を多面的に深めるために、実践者をゲストスピーカーとして適宜招く。",
    "credits": 4.0
  },
  {
    "id": "ECON-4-C4-1234-002",
    "code": "ECON-4-C4-1234-002",
    "name": "ゼミ（ビジネスモデル分析）",
    "description": "１ラウンドにつき３～４社の対象企業を設定し、それぞれの企業、業界が抱える課題を洗い出した上で、実践的な改革提案の策定プロセスを指導する。1～15回と16～30回の2ラウンドで実施する。具体的には消費者ヒアリング、データ分析、企業に対するヒアリング等をもとに提案を組み立てる。",
    "credits": 4.0
  },
  {
    "id": "ECON-4-C4-1234-003",
    "code": "ECON-4-C4-1234-003",
    "name": "ゼミ（経済発展を考える）",
    "description": "身近な町興しやベンチャービジネスの具体的な事例を考察しながら、開発経済の本質的問題を考える機会を提供する。東広島市、広島県、日本経済、アジア経済、グローバル経済等を具体的な題材とし、経済発展と貧困克服の問題点に関して深く議論し、政策の基本的視点、思想、手法、問題について考察を行う。",
    "credits": 4.0
  },
  {
    "id": "ECON-4-C4-1234-004",
    "code": "ECON-4-C4-1234-004",
    "name": "ゼミ（計量経済）",
    "description": "計量経済学の有用性と分析の流れを理解する上で、社会や経済の現象をデータを用いて分析し解釈する手法を指導する。具体的には、非線形モデルの扱いやダミー変数の活用、回帰分析手法などを文献講読と身近な事例を使ったディスカッションを通じて教示する。また、決定要因の解明、効果の測定のテーマでは、グループワークとその発表を通じて、より深い実践的理解を促す。",
    "credits": 4.0
  },
  {
    "id": "ECON-4-C4-1234-005",
    "code": "ECON-4-C4-1234-005",
    "name": "ゼミ（幸福曲線）",
    "description": "自分の過去の幸福曲線を分析し、幸福イベントや不幸イベントを積み上げて価値体系の樹形図を作る方法を教える。また、戦後の日本、アメリカ、ヨーロッパ、中国、世界の幸福曲線を作って現代のおおまかな流れを把握させる。最後に、コンサルティング会社や金融機関の業界としての業務やキャリアの現状を把握させ、自分の幸福曲線や価値体系を前提に現状世界における大学卒業後のコンサルティング会社や投資銀行などのキャリアの選択肢の可能性について考えさせる。",
    "credits": 4.0
  },
  {
    "id": "DIGI-2-C3-1200-003",
    "code": "DIGI-2-C3-1200-003",
    "name": "メディアで検証する未来の作り方",
    "description": "本科目では、IT分野から世界を変えたイノベーションを取り上げる。成功事例・失敗事例の簡略化されたストーリーで紹介される製品やサービスが、実際は、その時代のライバルや環境との関係の中で生み出された事実を理解させる。そのために、当時のコンピューター専門誌を中心にしたメディアを検証しながら、失敗のすぐ横にあったチャンスやアイデアを発掘。幅広い視点でテクノロジーやマーケットを見る力を養う。",
    "credits": 2.0
  },
  {
    "id": "DIGI-2-C3-1200-004",
    "code": "DIGI-2-C3-1200-004",
    "name": "アニメのクオリティー管理と商品性",
    "description": "本科目では「クオリティー（品質）」の基礎知識について、アニメづくりを題材に教える。アニメ制作現場における品質保持方法を事例に、あらゆる業界に共通する考え方の修得をめざす。実社会において品質管理には標準の国際規格が存在し、アニメも近い考え方で製品化されている。工業界の「クオリティー・コントロール」も参照しつつ、「製品としてのアニメ」を理解することで、「ものづくり」の品質を向上可能な能力を高める。",
    "credits": 2.0
  },
  {
    "id": "DIGI-2-C3-0034-005",
    "code": "DIGI-2-C3-0034-005",
    "name": "マンガの企画立案とプロデュース論",
    "description": "本授業において教員は「マンガの企画の立て方」を学ぶことで、ビジネス視点を取り入れた実際の「売れる企画を立てられるスキル」を学生に理解させる。グループワークを通じて他者とのコミュニケーション能力を向上し、自己の個性を活かした好きをヒットにつなげる手法を指導します。演習を通して自己表現力の向上とマーケットに合ったアプローチを習得し、実践的なマンガ企画を発表する。これにより、学生がモノづくりに必要な型や観察力、ビジネスレベルで通用する企画のブラッシュアップ方法を養うことを目指す。",
    "credits": 2.0
  },
  {
    "id": "DIGI-2-C3-1200-006",
    "code": "DIGI-2-C3-1200-006",
    "name": "文化資源とメタバース",
    "description": "本演習では、メタバースと呼ばれるようになった仮想空間の起源と発展の経緯、現状の動向、そしてそれが本質として有しているコアな可能性を取り上げる。特に、伝統芸能からポップカルチャーにつながる文化資源を活用するメタバースの現状を詳細に理解していく。演習を通じて、メタバースの基本的な仕組みとその応用可能性を解説し、企画立案することができるような能力を養うことを目的とする。",
    "credits": 2.0
  },
  {
    "id": "DIGI-2-C3-0034-007",
    "code": "DIGI-2-C3-0034-007",
    "name": "文化資源のデジタルアーカイブ",
    "description": "本演習では、文化資源を対象としたデジタルアーカイブの起源と発展の経緯、現状の動向について取り上げる。まず、文化資源に関わるデータベースやアーカイブの実践事例について学んだ上で、特にMANGAと称される現代のポップカルチャーのデジタルアーカイブがどのように構築されているかについて理解させる。演習を通じて、デジタルアーカイブの基本的な仕組みとその応用可能性を解説し、企画立案することができるような能力を養う。",
    "credits": 2.0
  },
  {
    "id": "DIGI-3-C4-1234-002",
    "code": "DIGI-3-C4-1234-002",
    "name": "ゼミ（文化資源アーカイブとメタバース）",
    "description": "本ゼミでは、日本の表現文化（浮世絵からマリオまで）資源を対象としたアーカイブの歴史と現状に加えて、それらを社会的に活用するための新しい仮想環境として注目を集めているメタバースの動向について取り上げる。まず、表現文化資源に関わるデータベース／アーカイブ／メタバース（DAM）の実践事例について学んだ上で、新規のDAMを企画して構築する能力、また既存のDAMを活用した社会的サービスを練り上げて、実装していく能力を養う。",
    "credits": 4.0
  },
  {
    "id": "DIGI-3-C4-1234-003",
    "code": "DIGI-3-C4-1234-003",
    "name": "ゼミ（アニメ作品の分析メソッド）",
    "description": "アニメ作品を客観的に分析するメソッドを教える。「面白い・つまらない」などの主観ではなく、科学的に論証可能な方法を提示し、他のコンテンツにも応用可能な考え方を触発させる。スタイルは演習方式。学生は教員の指定するアニメ作品（歴史上、普遍的な価値のあるタイトル）を予習として鑑賞する（映画を中心とする）。1コマを解説と質疑に分け、活発な議論から作品の価値や時代背景を伝えるとともに、高い思考力を鍛える。",
    "credits": 4.0
  },
  {
    "id": "CAR-2-C3-1234-008",
    "code": "CAR-2-C3-1234-008",
    "name": "英語コミュニケーションⅢ（プレゼンテーション）",
    "description": "本科目では、各回のトピックについて学生自身が調べた内容をもとにスピーチを組み立て発表してもらう。また、プレゼンテーションをおこなう際のアイコンタクト、声の大きさや出し方、ジェスチャー、ビジュアルエイドについても学び、英語でプレゼンテーションをおこなう場合に必要な包括的な表現を体得する。また、学生はお互いのプレゼンテーションを聴き、内容についてフィードバックできるように指導する。",
    "credits": 2.0
  },
  {
    "id": "CAR-2-C3-1234-009",
    "code": "CAR-2-C3-1234-009",
    "name": "英語コミュニケーションⅣ（ビジネス会話）",
    "description": "ビジネスの現場を想定し、徹底的に汎用性を高めた英語表現を用いた、滑らかで途切れない英語の発話、対話の演習を繰り返し行う。演習の過程で、正しい英語の語彙、文法、表現を指導を行うと同時に、学生自身がそれぞれの状況において自主的に課題解決を志向し、自分と他者双方の目的を達成する意義のある会話、対話を組み立てるスキルを磨く機会を提供する。",
    "credits": 2.0
  },
  {
    "id": "CAR-2-C3-1200-010",
    "code": "CAR-2-C3-1200-010",
    "name": "デジタルトランスフォーメーション時代の働き方",
    "description": "海外の企業にいきなり就職することは難しい。しかし、IT分野については周辺知識さえあれば海外企業に就職し、活躍することが期待できる。本授業では、プログラミングのような操作的な能力については触れず、コンピュータがどう動くのか、エンジニアとはどういう仕事なのか、について学修し、海外で活躍する人材となるために必要なことを学修する。",
    "credits": 2.0
  },
  {
    "id": "CAR-3-C3-0034-003",
    "code": "CAR-3-C3-0034-003",
    "name": "アニメ産業に関わる仕事",
    "description": "本科目では、アニメ産業全体の中に「どのような仕事があるのか」を具体的に取りあげる。担当教員のアニメ業界内での実活動、および企業での管理職経験から得た知見をもとに、ピックアップした会社や職種を、具体的に解説する。アニメ業界に限らず普遍的に存在する役割分担の考え方を特に重視する。受講者が将来社会に出たときの対応能力を高めるためである。ディスカッションを行い、仕事に関する的確な考え方を養うことを目標とする。",
    "credits": 2.0
  },
  {
    "id": "PRJ-4-A3-1234-001",
    "code": "PRJ-4-A3-1234-001",
    "name": "プロジェクト実践",
    "description": "実社会で起こっている問題や課題を取り上げ、課題解決のステップを学びながら仮説と検証を繰り返し、学問分野に捉われず学修者自身が多様なデジタル・ツールを駆使し解決策を追求していく授業である。講義と演習を組み合わせ、テーマに関係のある事柄を中心とした学生同士の対話を繰り返し、様々な考えに触れながら検討・分析する。最終的には自ら考えた解決策を発表・フィードバックを行い、学生同士が学びを深めていくアクティブラーニングである。",
    "credits": 4.0
  },
  {
    "id": "OPT-1-D1-1030-001",
    "code": "OPT-1-D1-1030-001",
    "name": "イラストとエンタテインメントA",
    "description": "【ゲスト講師：フジワラヨシト】\nこの授業ではペイントツールの操作を学ぶとともにデジタル作画の特性について考察する。併せてゲストより表現上のレクチャーを行う。ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの技法について学ぶ授業である。共有スピードが速くトレンドの変化が著しいデジタルイラストに関し、本学では知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "OPT-1-D1-1030-002",
    "code": "OPT-1-D1-1030-002",
    "name": "イラストとエンタテインメントB",
    "description": "【ゲスト講師：絵葉ましろ】\nこの授業では代表的な構図手法と構図の良し悪しを学び、一枚絵の基本的な設計について考察する。併せてゲストより表現上のレクチャーを行う。ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの技法について学ぶ授業である。共有スピードが速くトレンドの変化が著しいデジタルイラストに関し、本学では知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "OPT-1-D1-0204-003",
    "code": "OPT-1-D1-0204-003",
    "name": "イラストとエンタテインメントC",
    "description": "【ゲスト講師：桜井輝子】\nこの授業では彩色の基礎と表現手法を学び、表現に適したスタイルについて考察する。併せてゲストより表現上のレクチャーを行う。ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの技法について学ぶ授業である。共有スピードが速くトレンドの変化が著しいデジタルイラストに関し、本授業では知識を本質的なものとするため、資料制作を行うことで、知識と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "OPT-1-D1-0204-004",
    "code": "OPT-1-D1-0204-004",
    "name": "イラストとエンタテインメントD",
    "description": "【ゲスト講師：荻pote】\nこの授業では、コンテンツの顔であるキービジュアルについて学ぶ。コンセプトの考え方、掘り下げ方を知り、訴求力のあるビジュアルとは何かを考える。ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの技法について学ぶ授業である。共有スピードが速くトレンドの変化が著しいデジタルイラストに関し、知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "OPT-2-D1-1030-001",
    "code": "OPT-2-D1-1030-001",
    "name": "イラストとデザインA",
    "description": "楽しみながらデジタルツールの使用法とデジタルイラストの創作について学ぶ授業である。共有スピードが速くトレンドの変化が著しいデジタルイラストに関し、知識を本質的なものとするため実際に制作をすることで、身体感覚と思考を融合させる学修を行う。この授業では美術解剖学の視点からイラストにおける筋肉や骨格の仕組み、動きを学ぶ。併せてゲストより表現上のレクチャーを行う。",
    "credits": 1.0
  },
  {
    "id": "OPT-2-D1-1030-002",
    "code": "OPT-2-D1-1030-002",
    "name": "イラストとデザインB",
    "description": "ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの創作について学ぶ授業である。共有スピードが速くトレンドの変化が著しいデジタルイラストの現状を学ぶため、手を動かして各種技法を身につけ、考察する。この授業ではライティングの基礎を学び、正しい陰影のありかたを身につけることで、三次元的な画像の説得力や、陰影のつけ方による感情表現などについて理解を深める。",
    "credits": 1.0
  },
  {
    "id": "OPT-2-D1-1030-003",
    "code": "OPT-2-D1-1030-003",
    "name": "イラストとデザインC",
    "description": "ポップカルチャーに触れ、親しみながらデジタルツールの使用法とイラストレーションの創作について学ぶ授業である。ここではイラストレーターとして就業するシミュレーションを行い、売り込みのスキル、SNSなどネットを活用して社会的影響力を強める方法論、商業展開と媒体のバリエーション、同人活動の現状と経済原理・コミッション・サブスク支援の知識などを学ぶ。これによりイラストレーションを取り巻く経済圏を理解する。",
    "credits": 1.0
  },
  {
    "id": "OPT-2-D1-0204-004",
    "code": "OPT-2-D1-0204-004",
    "name": "イラストとデザインD",
    "description": "【ゲスト講師：三澤寛志】\nこの授業ではデッサンを通して、観察力とイラストの価値や本質を見極める力を養う。併せてゲストより表現上のレクチャーを行う。手を動かしながらイラストの創作について学ぶ授業である。基礎的な知識からどのようにものの見方があるかを学ぶことにより、創作プロセスを理解し思考力を養う。画像についての知識を本質的なものとするため、手を動かし制作をすることで、身体感覚と思考を融合させる学修を行う。",
    "credits": 1.0
  },
  {
    "id": "OPT-3-D1-1030-001",
    "code": "OPT-3-D1-1030-001",
    "name": "イラストとその活用A",
    "description": "ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの活用について学ぶ授業である。デジタル化した現代社会で、コミュニケーションの手段としてイラストは重要な位置を占める。この授業ではコンセプト構築の手法からイラストの商業的な役割を考察する。ストーリーやバックボーンから、アイデアの出し方、資料の集め方、使い方を学び、オーダーを受けて制作される作品に必要なコンセプトとその構築法を理解する。",
    "credits": 1.0
  },
  {
    "id": "OPT-3-D1-1030-002",
    "code": "OPT-3-D1-1030-002",
    "name": "イラストとその活用B",
    "description": "ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの活用について学ぶ授業である。ここではマーケティングの視点から、デジタルイラストが活用されるシチュエーションと要求される技法などについて知る。ゲーム、アニメーション、書籍、VTuberなど、各業界の現状と、そこでのイラストの役割、どのような作風がユーザーの支持を集めているかを学び、自分の描いたイラストの商業的価値についてもシミュレーションしてみる。",
    "credits": 1.0
  },
  {
    "id": "OPT-3-D1-0204-003",
    "code": "OPT-3-D1-0204-003",
    "name": "イラストとその活用C",
    "description": "ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの活用について学ぶ。デジタルイラストについての知識を本質的なものとするため、学生自身が具体的に手を動かして各種技法を身につけつつ、イラストの商業的な役割を考察する。この授業では、ヴィジュアル系エンタテインメントの現場で非常に重要な背景美術がテーマである。遠近法から、背景の描き方までを習得して、イラストにおける世界観を学ぶ。",
    "credits": 1.0
  },
  {
    "id": "OPT-3-D1-0204-004",
    "code": "OPT-3-D1-0204-004",
    "name": "イラストとその活用D",
    "description": "ポップカルチャーに触れ、親しみながらデジタルツールの使用法とデジタルイラストの活用について学ぶ。イラストについての知識を本質的なものとするため、学生自身が具体的に手を動かして各種技法を身につけつつ、ヴィジュアルの商業的な役割を考察する。この授業では、日本のコンテンツ産業を代表するジャンル、アニメーションについて学ぶ。動き、感情表現、色彩、レイアウトなどの総合芸術であるアニメーションの技法について考察する。",
    "credits": 1.0
  },
  {
    "id": "OPT-1-C1-1030-999",
    "code": "OPT-1-C1-1030-999",
    "name": "特記事項参照(2025年度)",
    "description": "順次公開予定",
    "credits": 2.0
  },
  {
    "id": "OPT-2-C1-1030-999",
    "code": "OPT-2-C1-1030-999",
    "name": "特記事項参照(2026年度)",
    "description": "順次公開予定",
    "credits": 2.0
  },
  {
    "id": "OPT-3-C1-1030-999",
    "code": "OPT-3-C1-1030-999",
    "name": "特記事項参照(2027年度)",
    "description": "順次公開予定",
    "credits": 2.0
  },
  {
    "id": "OPT-4-C1-1030-999",
    "code": "OPT-4-C1-1030-999",
    "name": "特記事項参照(2028年度)",
    "description": "順次公開予定",
    "credits": 2.0
  },
  {
    "id": "INF-2-C1-1030-012",
    "code": "INF-2-C1-1030-012",
    "name": "計算機実験で学ぶ確率とモンテカルロ法",
    "description": "この講義では、乱数を使った計算機実験を楽しみながら、次のことを学ぶ。\n１．大数の法則や中心極限定理などを含む確率の基礎\n２．乱数を用いた数値計算法（モンテカルロ法）の基礎\n１では、乱数を用いた実験を通じて抽象的にみえる数学的な概念を具体的に観察する。２では、一見するとランダムネスに関係ない計算に乱数が使われる様子を示す。受講者がプログラム（R言語を想定）を書いて実行することでより理解が深まるが、プログラミングは全くだめ、という方が受講されても筋道が理解できるような構成とする。２に「モンテカルロ法」とあるが、ベイズ統計やその他のデータ解析手法について学ぶ講義ではないので注意すること（マルコフ連鎖モンテカルロ法についてはベイズ統計とは関係のない例で説明する）。",
    "credits": 2.0
  },
  {
    "id": "INF-2-C3-1200-023",
    "code": "INF-2-C3-1200-023",
    "name": "統計学展望",
    "description": "一般に統計学の講義には実学的な面が求められるが、この講義ではあえて「 すぐには役立たない統計学」として、シンプルな例を用いて、 ベイズ統計 、頻度論的統計、予測など、  確率分布を用いる統計学の基礎となる考え方を俯瞰する。ソフトウェアの使い方などの実用面をはぶく代わりに、統計学の諸概念の意味するところを新鮮な目で眺めてみたい。本学講義の「統計学を哲学する」が科学哲学の立場から同様のテーマを扱っているのに対し、統計的手法の研究者の立場からデータサイエンスの枠組みを見なおす内容となる。",
    "credits": 2.0
  }
]